{
    "asin": "B0CRHZZLYR",
    "productName": "Apple iPhone 15 Pro Max, 256GB, Blue Titanium - Unlocked (Renewed Premium)",
    "reviews": [
        {
            "name": "Hailey",
            "location": "United States",
            "date": "March 30, 2025",
            "verified-purchase": true,
            "review-body": "So far so good, ive had it about 3 days now. Its at maximum battery capacity (100%), which is really nice and was one of my main concerns. There are no noticeable scratches or scuffs, it does everything a phone should do. My husband ordered a different phone from this company and it also is in mint condition (as far as the eye can see).",
            "rating": 5.0
        },
        {
            "name": "J. Jacobs",
            "location": "United States",
            "date": "April 3, 2025",
            "verified-purchase": true,
            "review-body": "Very happy with purchase. Strongly recommend interested buyers take advantage of amazons return policy and order this to evaluate your particular shipped phone.\n\nMine came and was basically brand new - it had gone thru 6 charge cycles but showed no evidence of use or wear. Extremely happy and got a great value.\n\nWill use Amazon again for my next iPhone upgrade!",
            "rating": 5.0
        },
        {
            "name": "me",
            "location": "United States",
            "date": "December 7, 2024",
            "verified-purchase": true,
            "review-body": "Updated: since writing the below review, I have received my second 15 pro max renewed premium, set it up, and handled the refund from the first one. Amazon customer support also offered me a generous discount on the new phone for all the hassle (which I somewhat needed to initiate asking for, I doubt they would have offered that to begin with). If I had to do it all over again - I would have still gone this route since apple refurbished hasn’t released this model yet, but moving forward- I will probably order straight from apple refurbished next time or just get a new iPhone. When factoring the discount I got on this one that’s one year old, I paid about 2/3 the cost for this compared to the latest model, so I can’t complain. All that said, in general I am one who much more values my time and ease over saving a quick bucks. Especially if that quick buck saved costs me HOURS of my life in hassle. If you’re like me in that sense - proceed with caution. I trust Amazon will help make it right if you don’t get a great phone as expected, but even if that’s the case, you’re probably in for quite the hoops to jump through in order to make that happen.\n\nHere’s my original, unedited review:\n\nI ordered the iPhone 15 Pro Max refurbished and it arrived last night. After spending a good 3+ hours setting it up, I realized the lens for the main camera was broken. From the outside, you can’t see any issue. It wasn’t until I opened up the camera app that I actually saw it didn’t work.\n\n“Renewed Premium” carries a certain standard with it, and this certainly does not meet that in the slightest. On top of that, upon calling customer support, I was told that I would not be able to do anything unless I deactivated the phone and remove my Apple ID from it. Wouldn’t have been the end of the world if I needed to go back to my other phone for a bit, however, in order to set up this phone with the eSIM, deactivated my previous SIM card. Upon explaining all of that to customer support, I was told there was nothing they could do unless I deactivated this phone (leaving me without a phone until they received this and shipped me a new one)\n\nI was then told to call Apple to see what they can do, when honestly, this is their mistake. Either way, I called apple and it was going to be another set of hoops to jump through with scheduling appointments and all that. Plus since I didn’t have apple care, if they needed to repair the camera, I would still be without a phone. So even if Apple was able to help fix this, the issue of me not having a phone would still be there. Had I broken this camera myself - I would certainly except those terms given there’s not much else I could do. However, this was given to me in this condition and for Amazon to leave me with the responsibility of fixing their mistake due to carelessness in inspection and quality control is absurd.\n\nSo whether I like it or not, I am now STUCK with the responsibility of cleaning this up since my account is connected to this phone now. What at one point could have been a great gift to myself has turned into the biggest hassle I’ve experienced buying/returning anything, probably ever.\n\nI’m going to give this one more shot as I’ve now ordered another iPhone from them to be delivered shortly, however, it’s also required me to spend another ~$1000 in having that iPhone sent prior to me getting my refund. This is absolutely ridiculous and unacceptable. Even if this next phone is perfect, I’m likely never going to order from the Amazon refurbished store again. I’ll either go straight to Apple refurbished, or brand new, for any of my future phone/laptop/device purchases.\n\nOn top of all this hassle, I’ll certainly have to spend another few hours setting up my replacement phone once it arrives.\n\nAll the time I’ve invested into this so far has NOT been even close worth the “nice discount” on a premium refurbished phone that should have arrived without issue to begin with.\n\nAmazon - take note. Change your policies. Making this the customer’s mess to clean up is not acceptable.\n\nPotential buyers - BEWARE of the risks.\n\nI’ll plan to update this review if anything changes. But like I said, even if the next phone I ordered is perfect, I still give this a 1-star review for all the hassle and lack of responsibility the company took to resolve this.\n\nP.s. i’ll also add that I am a quite understanding and peaceful person. The person I spoke with from customer support was doing his absolute best to help me, but this was clearly a bigger issue than he had the power to solve. I requested to have this escalated to upper management and was told the same thing. Whoever is the one making decisions about what can and can’t be done needs to hear about this.",
            "rating": 1.0
        },
        {
            "name": "Geronimo",
            "location": "United States",
            "date": "April 13, 2025",
            "verified-purchase": true,
            "review-body": "Bought an Amazon renewed (Premium) iPhone 15 Pro Max, and it looked like it was brand new. Phone had only been first activated 8 months earlier and had 98% battery capacity. Works perfectly. I would absolutely buy it again, especially considering the Premium grade phones have a 12 month return/exchange warranty. Saved a ton of money off buying brand new.",
            "rating": 5.0
        },
        {
            "name": "Gabriela H.",
            "location": "United States",
            "date": "April 14, 2025",
            "verified-purchase": true,
            "review-body": "The phone looked excellent!\nbattery was at 93% and it stated teh amount of charge cycles.\n\nThere were very small dents in the screen glass, not visible from afar.\nIt was a great choice and purchase.",
            "rating": 5.0
        },
        {
            "name": "Jamie diaz",
            "location": "United States",
            "date": "April 5, 2025",
            "verified-purchase": true,
            "review-body": "All parts were genuine and the phone was spotless with no damage. The battery however was a bit low at 93% with 330+ cycles.",
            "rating": 4.0
        },
        {
            "name": "Vinny",
            "location": "United States",
            "date": "February 16, 2025",
            "verified-purchase": true,
            "review-body": "I recently had the privilege of purchasing an iPhone 15 Pro Max directly from Amazon through their Amazon Renewed Premium program. The iPhone 15 Pro Max I acquired is in pristine condition, showing no visible signs of wear and tear. It feels as if it was freshly unboxed. The cycle count is remarkably low, in the 40s, and the battery is at a full 100%. This exceptional condition allowed me to extend its protection by purchasing AppleCare+ at the Apple Store. The phone operates flawlessly, surpassing all my expectations. I am genuinely impressed and rarely write reviews, but this purchase was so satisfying that I felt compelled to share my experience.",
            "rating": 5.0
        },
        {
            "name": "Carlos",
            "location": "United States",
            "date": "March 29, 2025",
            "verified-purchase": true,
            "review-body": "Got one hell of a gem from the seller, very low cycle count and 100% capacity battery. Starts up well and I'll edit within 3 months with a final review",
            "rating": 5.0
        },
        {
            "name": "Sebastián Rocha",
            "location": "United States",
            "date": "April 4, 2025",
            "verified-purchase": true,
            "review-body": "La compra estuvo buena, se encuentra sin ningun rasguño, golpe u otro daño fisico. Totalmente impecable. Todo funciona muy bien. Le coloco 4 estrellas porque la condición de la bateria está en 91%, y con 280 ciclos, podría ser mejor como he visto en varios casos que les tocó con >95%.",
            "rating": 4.0
        },
        {
            "name": "Amzongrlla",
            "location": "United States",
            "date": "March 29, 2025",
            "verified-purchase": true,
            "review-body": "No premium. Internal camera lens housing was deeply scratched as it was taken apart. Wasn't happy with the 92% battery health for a 1 year phone used or not. 100 dollars would need to be adjusted for me to keep, sent back. Oh yeah had to travel 12 miles to an Amazon hub to return, not 🚫 cool.",
            "rating": 4.0
        },
        {
            "name": "Harper",
            "location": "United States",
            "date": "April 11, 2025",
            "verified-purchase": true,
            "review-body": "100% battery health with 2 cycles!!!! The phone seemed to be in a used condition when I got it because it was just wrapped in’s some plastic, but there were no scrapes at all and the batter clearly shows it hasn’t been used.",
            "rating": 5.0
        },
        {
            "name": "Semone",
            "location": "United States",
            "date": "April 10, 2025",
            "verified-purchase": true,
            "review-body": "I mean, I was expecting it to be good but I’m actually dumbfounded. There’s not a scratch or a dent on it, and battery is at 100% with 1 cycle count. This thing is so immaculate I could cry. Would recommend 10000%",
            "rating": 5.0
        },
        {
            "name": "Joshua Jones",
            "location": "United States",
            "date": "March 25, 2025",
            "verified-purchase": true,
            "review-body": "Did not even come with a box. Plus, the cord is so short.",
            "rating": 4.0
        },
        {
            "name": "Mann",
            "location": "United States",
            "date": "April 3, 2025",
            "verified-purchase": true,
            "review-body": "Didn’t expect it to be this good. Not a single scratch on the whole phone and battery was at 100%.\n\nAlthough it did have some smudges but it came off easily. At this price the value proposition is the best.",
            "rating": 5.0
        },
        {
            "name": "David Y.",
            "location": "United States",
            "date": "April 8, 2025",
            "verified-purchase": true,
            "review-body": "It said premium refurbished and that is exactly what I got here. I’m completely satisfied with this purchase so far I’ve only had a week but I don’t regret this pick up.",
            "rating": 5.0
        },
        {
            "name": "J. Gordon",
            "location": "United States",
            "date": "April 9, 2025",
            "verified-purchase": true,
            "review-body": "Like New. No Scratches. Battery at 100% condition. Excellent price.\n\nPlus, 1 year free return policy when you buy a Renewed Premium product. Wow!\n(90 days for regular Renewed.)",
            "rating": 5.0
        },
        {
            "name": "Alex",
            "location": "United States",
            "date": "March 31, 2025",
            "verified-purchase": true,
            "review-body": "This is without a doubt the best purchase I’ve ever made! The battery is at 100% with 0 cycles used, the phone is practically new, not a single scratch! I’m super happy, I HIGHLY RECOMMEND IT!",
            "rating": 5.0
        },
        {
            "name": "mahi",
            "location": "United States",
            "date": "April 10, 2025",
            "verified-purchase": true,
            "review-body": "This phone was amazing. Surprised at how good it was in excellent condition. Would definitely buy again.",
            "rating": 5.0
        },
        {
            "name": "Jane dollahan",
            "location": "United States",
            "date": "February 16, 2025",
            "verified-purchase": true,
            "review-body": "I’m only rating this a 4 star because my battery health is only at 91% so I’m a little bummed about that but so far ok I had no issues getting the phone connected with my phone carrier",
            "rating": 4.0
        },
        {
            "name": "Battsetseg",
            "location": "United States",
            "date": "April 16, 2025",
            "verified-purchase": true,
            "review-body": "Good quality, got 99% battery health.",
            "rating": 5.0
        },
        {
            "name": "Hamedath Soamandaugh",
            "location": "United States",
            "date": "April 16, 2025",
            "verified-purchase": true,
            "review-body": "Very cool I love it",
            "rating": 5.0
        },
        {
            "name": "B's",
            "location": "United States",
            "date": "April 6, 2025",
            "verified-purchase": true,
            "review-body": "I purchased a refurbished product...deemed to be Premium. I love it. It is flawless.",
            "rating": 5.0
        },
        {
            "name": "David Montiel",
            "location": "United States",
            "date": "April 13, 2025",
            "verified-purchase": true,
            "review-body": "Excelente condiciones se los recomiendo",
            "rating": 5.0
        },
        {
            "name": "Jevonie kitchin",
            "location": "United States",
            "date": "April 13, 2025",
            "verified-purchase": true,
            "review-body": "Awesome quality…this did not disappoint",
            "rating": 5.0
        },
        {
            "name": "Hector Espinel",
            "location": "United States",
            "date": "April 9, 2025",
            "verified-purchase": true,
            "review-body": "Excellent quality, device is very nice 👍🏼",
            "rating": 5.0
        },
        {
            "name": "Aditya S.",
            "location": "United States",
            "date": "January 30, 2025",
            "verified-purchase": true,
            "review-body": "Came in Almost Brand new Condition not scratches or marks, it won't come in the official box, you are only paying for the phone , will come in amazon renwed box, with a OK Male A to type c cable",
            "rating": 4.0
        },
        {
            "name": "Haseeb Khan",
            "location": "United States",
            "date": "March 30, 2025",
            "verified-purchase": true,
            "review-body": "THANK YOU AMAZON YOU DID NOT DISAPPOINT WITH THIS SALE I LOVE MY 1TB 15 PRO MAX",
            "rating": 5.0
        },
        {
            "name": "Chin",
            "location": "United States",
            "date": "April 1, 2025",
            "verified-purchase": true,
            "review-body": "phone is in good condition and battery health is 95% no scratches no dent cleannnn",
            "rating": 5.0
        },
        {
            "name": "sophia chavez",
            "location": "United States",
            "date": "November 27, 2024",
            "verified-purchase": true,
            "review-body": "Based on this positive experience. I might start buying used phones from amazon when it’s time to upgrade. The battery health was a little disappointing, but of course there will always be some sort of downside when buying used. Other than that the phone is in pristine condition. Easy setup with no problems while setting up my line. Wished I bought more memory like the 512GB but lesson learned there. Delivery was fast and convenient too. So far nothing too negative that turns me off from trying this again in the future! If ur on the fence I say give it a shot. U might find the experience just as good or better than mines.",
            "rating": 4.0
        },
        {
            "name": "Ahmed",
            "location": "United States",
            "date": "March 21, 2025",
            "verified-purchase": true,
            "review-body": "Highly recommend, battery is 100% LOOKS UNTOUCHED, no scratches everything is pristine. Obviously check when i posted this review, because as time goes the quality will dip",
            "rating": 5.0
        },
        {
            "name": "Lordben",
            "location": "United States",
            "date": "April 8, 2025",
            "verified-purchase": true,
            "review-body": "Wonderful",
            "rating": 5.0
        },
        {
            "name": "Coqueta",
            "location": "United States",
            "date": "April 7, 2025",
            "verified-purchase": true,
            "review-body": "Exelente servisio",
            "rating": 5.0
        },
        {
            "name": "Deavion McIntosh",
            "location": "United States",
            "date": "January 5, 2025",
            "verified-purchase": true,
            "review-body": "Delivery was quick & for a refurbished phone came with decent battery health. No scratches or cracks. I dont like that they didnt give an authentic apple charger so thats why i deducted a star.\nOnly returning since i bought this as a present for a sibling and someone else bought them the phone.",
            "rating": 4.0
        },
        {
            "name": "Amanda",
            "location": "United States",
            "date": "March 17, 2025",
            "verified-purchase": true,
            "review-body": "Came on time, packaged very well, and was just as I would hope it would be. In mint condition. The phone looked brand new. So happy with my purchase.",
            "rating": 5.0
        },
        {
            "name": "Rajendra Patel",
            "location": "United States",
            "date": "January 29, 2025",
            "verified-purchase": true,
            "review-body": "If refurbished then price will be less around 30 to 35%",
            "rating": 4.0
        },
        {
            "name": "rberg",
            "location": "United States",
            "date": "February 13, 2025",
            "verified-purchase": true,
            "review-body": "Purchase this phone as a gift and it works flawlessly. The gift was for someone who had never purchased a phone online before and was very skeptical being a refurbished phone I insured them that it would work perfectly and that is what happened the phone works perfectly and they are very surprised that they spent so much unnecessary money buying directly from the cell phone companies Instead of purchasing on Amazon",
            "rating": 5.0
        },
        {
            "name": "Luis",
            "location": "United States",
            "date": "March 31, 2025",
            "verified-purchase": true,
            "review-body": "Exelente",
            "rating": 5.0
        },
        {
            "name": "Ruppels",
            "location": "United States",
            "date": "February 27, 2025",
            "verified-purchase": true,
            "review-body": "I always get a version behind. Traded in my old X. Coulodn't be happier. Looks new. Battery is 100% good. The camera is awesome and it will handle AI when it's available, just like the 16 model.",
            "rating": 5.0
        },
        {
            "name": "Ian Clark",
            "location": "United States",
            "date": "March 13, 2025",
            "verified-purchase": true,
            "review-body": "Good used product - but a little disappointing. There is a distinct scuff on the bottom corner of the frame (definitely visible from more than 12 inches away), there is a small but certainly noticeable scratch in the middle of the screen (also from more than 12 inches away), and there was even a strange residue on the side of the phone that needed to be gently but firmly cleaned off. I was surprised that the battery health indicator still said 100%. I was fearful that it would be closer to 90%. All in all, most of these (except the screen scratch) are easily overlooked for an 1.5 year old used iPhone, except for the fact that I purchased the top-of-the-line Renewed Premium tier. If I’m spending $900 on a year and a half old iPhone, I expect smaller and less immediately noticeable scuffs, and certainly no obvious scratches on the screen (especially one in the center), and hopefully no strange residue either. Additionally, it came with a USB-A to USB-C cable. But this is 2025 and this is an iPhone 15 Pro Max. I feel fully justified in having expected to receive the now standard USB-C to USB-C cable. Again, these are tiny nitpicks, and this used iPhone 15 Pro Max is just fine for the most part, but the condition of this phone just doesn’t match the standard of “premium renewed” and it’s extra cost. Should have been only “good” condition.",
            "rating": 2.0
        },
        {
            "name": "Amazon Customer",
            "location": "United States",
            "date": "March 10, 2025",
            "verified-purchase": true,
            "review-body": "I love love this phone it was the best purchase I could’ve ever bought in a while. Thank you Amazon.",
            "rating": 5.0
        },
        {
            "name": "Jason M.",
            "location": "United States",
            "date": "November 4, 2024",
            "verified-purchase": true,
            "review-body": "I bought this iPhone 15 Pro Max as “used” from Amazon. IT WAS PERFECT!!!! As “like new” in anyone’s definition!!! I’m VERY SATISFIED with my purchase!!!\n\nI bought a different phone before, but through another vendor, sold by a third party. Unfortunately, that third party wasn’t honest about the condition of the phone they sold me. They listed it as “like new”, but what I got was FAR from what I’d call “like new!!!” It had clearly visible scratches on both the front and back, visible in any lighting conditions!!! Also, in the system settings, it had a warning, “screen not recognized”, meaning the original screen was replaced with an unofficial aftermarket screen!!! The other problem was the battery! It would drain like crazy and inconsistently!!! Some days it would last all day with moderate use. Other times it would completely die in under THREE HOURS with very light use or no use at all!!! (and YES, I tried turning off app background refresh! I even tried leaving it in airplane mode!)\n\nUnfortunately, I didn’t discover all this within the 30 day return policy of that vendor, so I was SOL on my $430 bucks!!! At least Amazon might give me $140 as a trade-in.\n\n(I should’ve went through Amazon instead of that other vendor) 🙁",
            "rating": 5.0
        },
        {
            "name": "Mohamed",
            "location": "United States",
            "date": "January 9, 2025",
            "verified-purchase": true,
            "review-body": "tru tone working but battery health is 98%",
            "rating": 4.0
        },
        {
            "name": "Kan F.",
            "location": "United States",
            "date": "February 28, 2025",
            "verified-purchase": true,
            "review-body": "Llegó excelente y a un buen precio. Tenía una mancha en uno de los bordes pero no se notaba y la batería tenía 99%. Del resto como nuevo.",
            "rating": 5.0
        },
        {
            "name": "William",
            "location": "United States",
            "date": "August 14, 2024",
            "verified-purchase": true,
            "review-body": "My wife have been contemplating getting a new iPhone because hers had reached the capacity on storage and the battery was not keeping a long charge. I think she had the iPhone 8. We ARE NOT a couple that splurge because finances dictate that we be humble. So when I was searching for a phone I was looking at the iPhone 11 or 12. But knowing the 15 was out and it got crazy praise I called our local Apple store for advice. The gentleman told me the 11 would be a huge upgrade from the 8 that she had. But he said with the 15 she would have all the latest technology AND she wouldn't have to upgrade for at least 4 yrs considering she had the 8 for 3 yrs and we bought that the end of 2020. So I took a deep breath, came to my saved items on prime and purchased this \"refurbished\" iPhone 15. I'm GenX. I came up when the Nokia, Sony Erickson, Motorola RAZR (the grey flat one) and Nextel we're wassup. So spending a G on a phone was a HARD NO for me. But this time I said EFF IT. This phone was brand new, works flawlessly, it's everything she ever wanted from her old phone. We're on Verizon but the phone came unlocked. It took a little long because the phone needed an Apple update but after an hour it was up and running. So if you're on the fence about getting this \"refurbished\" iPhone 15 Pro Max because of condition, functionality or network issues don't be. Our experience was great 💯.",
            "rating": 5.0
        },
        {
            "name": "Sher Mohammad",
            "location": "United States",
            "date": "December 12, 2024",
            "verified-purchase": true,
            "review-body": "I thought when buying this phone that I would be scammed or that there would be a hidden \"what if\" with the purchase. I was going to go buy the phone at apple, but it turns out that they don't sell this version anymore despite being less than a year old. The only other option was to go to my service provider, but they end taking too much of my time and they normally sell locked phones. However, I took the chance and decided to buy it, and I was proven wrong. There was not a single scratch nor dent on the phone, and it was brand new. I did check the battery health and it was at 92% and the iPhone was actually unlocked when I looked at the settings. No stolen records were found when I searched for it with IMEI and other resources. Definitely worth it!",
            "rating": 5.0
        },
        {
            "name": "Bicycleman",
            "location": "United States",
            "date": "January 18, 2025",
            "verified-purchase": true,
            "review-body": "Super happy with this purchase. 1Tb storage for not much more than base storage. Saved over $650 vs buying new iPhone 16 Pro Max. About the same price as buying on ebay, with 1 year return or replace from Amazon on the “Premium” level.\nOnly tiny flaw in phone was a minuscule nick in the screen. Really really small, not visible with screen protector. No scratches,\nno cracks.\nBattery shows 259 cycles, charges to 99%. Does not drain quickly.\nI paid for the monthly protection coverage. Asurion has always been great the two or three times I’ve used them.",
            "rating": 5.0
        },
        {
            "name": "Placeholder",
            "location": "United States",
            "date": "March 7, 2025",
            "verified-purchase": true,
            "review-body": "Loved it. Felt too big. Switched back to a 13 Pro and now regretting that decision.",
            "rating": 5.0
        },
        {
            "name": "Victoria rios",
            "location": "United States",
            "date": "November 16, 2024",
            "verified-purchase": true,
            "review-body": "I received my phone in excellent condition, however it is too heavy for me because I have carpal tunnel in m wrist so it’s very uncomfortable for me to hold up. M previous phone was an IPhone SE, much more comfortable for me. Considering returning it. Other than that I have no complaints.",
            "rating": 4.0
        },
        {
            "name": "ABDUL NAZIR MALIK ZADA",
            "location": "United States",
            "date": "March 17, 2025",
            "verified-purchase": true,
            "review-body": "Thanks",
            "rating": 5.0
        },
        {
            "name": "DM",
            "location": "United States",
            "date": "January 10, 2025",
            "verified-purchase": true,
            "review-body": "Again, very satisfied with a Renewed device purchase. This time I tried Renewed Premium, it was at a good price. I wanted the guarantee of perfect quality and above 90% batt health. I got lucky and got a device still at 100% even though charge cycles was a bit high. Still holding at 100% even after 1 month of use with daily charging and 1 OS update. Phone was in mint (literally new) condition. Only downside was that the charger cable included in tbe box was basically cheap and I wouldn't recommend using it to charge.",
            "rating": 5.0
        },
        {
            "name": "Vickie Y",
            "location": "United States",
            "date": "March 11, 2025",
            "verified-purchase": true,
            "review-body": "Love it",
            "rating": 5.0
        },
        {
            "name": "Dany Fernando Henao",
            "location": "United States",
            "date": "March 12, 2025",
            "verified-purchase": true,
            "review-body": "Good",
            "rating": 5.0
        },
        {
            "name": "Amazon Customer",
            "location": "United States",
            "date": "February 26, 2025",
            "verified-purchase": true,
            "review-body": "This phone surpassed my expectations and in an exceptional physical condition. I will absolutely recommend it",
            "rating": 5.0
        },
        {
            "name": "william e.",
            "location": "United States",
            "date": "March 24, 2025",
            "verified-purchase": true,
            "review-body": "The phone is too big. Would like to trade it in for a smaller series 15",
            "rating": 3.0
        },
        {
            "name": "Dog 234",
            "location": "United States",
            "date": "January 12, 2025",
            "verified-purchase": true,
            "review-body": "I'm very happy with my phone! It was a big savings from buying a new iPhone and it has the max storage. Perfect condition, not even a scratch. I called Apple and they said it was less than a year old and never had any problems. Love the blue color too. Just wish the charging cable was an Apple charger and it is on the short side. There is no charging plug but Apple doesn't given you a plug anymore either.",
            "rating": 5.0
        },
        {
            "name": "Jim Wilde",
            "location": "United States",
            "date": "January 19, 2025",
            "verified-purchase": true,
            "review-body": "We played this roulette twice. The first phone was a success—practically no scratches on the screen, only 2 battery recharge cycles, and 100% battery health usage since 10.2024. We decided to keep it.\n\nThe second one turned out to be heavily used, with 188 battery recharge cycles, usage since 07.2023, and a noticeably scratched screen in several places—all while being advertised as \"almost like new.\"\n\nNow we have to wait a month to get our money back. Quite the setup they’ve got for free lending...",
            "rating": 3.0
        },
        {
            "name": "Erwing Ordóñez",
            "location": "United States",
            "date": "September 27, 2024",
            "verified-purchase": true,
            "review-body": "I bought the refurbished iPhone 15 Pro Max on Amazon, and at first, I had some concerns because it had a 3.8-star rating. When I looked at the reviews, most of the complaints were about minor issues like small scratches or the charger not being original. However, I decided to go for it since it was a premium refurbished item, and some reviews mentioned that they had good experiences with battery conditions of 98% or higher, with only the occasional replaced part.\n\nI went ahead and ordered it, and it turned out to be one of the smartest purchases I’ve made. The iPhone arrived in perfect condition, with no scratches at all, and only 25 charge cycles, meaning the battery is practically at 100%. I connected it to Utool, and it gave me a score of 100, showing that all the parts are original. It feels like a brand-new phone, as if I just took it out of its original box. I would definitely buy another premium refurbished iPhone in the future.",
            "rating": 5.0
        },
        {
            "name": "Terry Ranson",
            "location": "United States",
            "date": "February 14, 2025",
            "verified-purchase": true,
            "review-body": "Phone is in perfect condition no scratches dents or dings I'm very happy with my choice before you buy your next phone i highly suggest checking here first",
            "rating": 5.0
        },
        {
            "name": "Barbie",
            "location": "United States",
            "date": "February 27, 2025",
            "verified-purchase": true,
            "review-body": "Works great! Looks great!",
            "rating": 5.0
        },
        {
            "name": "William P. Benner",
            "location": "United States",
            "date": "December 6, 2024",
            "verified-purchase": true,
            "review-body": "So I had left a 20 foot extension ladder leaning against the gutter due to putting up some Christmas lights but I hadn't finished the job. The wind blew up and made the ladder fall on the box that this iPhone was delivered in. I was quite pleased that the packaging took the hit and didn't damage the phone. The phone I received was in true renewed premium condition, with the battery life meter still showing 100% capacity and no notable blemishes on the phone. Mine came with a USB A to C charger cable but no block.",
            "rating": 5.0
        },
        {
            "name": "Amazon Customer",
            "location": "United States",
            "date": "November 19, 2024",
            "verified-purchase": true,
            "review-body": "Excellent condition but my only complaint would be the battery was 90% but good phone",
            "rating": 4.0
        },
        {
            "name": "Lewis W.",
            "location": "United States",
            "date": "January 19, 2025",
            "verified-purchase": true,
            "review-body": "While most features work on the phone, computers do not recognize the phone. I therefore cannot use iturnes to add music to the phone. That is an important feature to me and therefore I am considering returning the phone. I have tried everything including chatting with amazon support to no avail",
            "rating": 3.0
        },
        {
            "name": "Nathan Slaughter",
            "location": "United States",
            "date": "October 28, 2024",
            "verified-purchase": true,
            "review-body": "Phone came and worked perfectly fine and was in perfect condition, checked battery cycles and it only had 1 cycle on it meaning it was brand new!",
            "rating": 4.0
        },
        {
            "name": "PJM",
            "location": "United States",
            "date": "January 22, 2025",
            "verified-purchase": true,
            "review-body": "Phone worked well but the screen was either cleaned with a mild abrasive or something but I could not get a screen saver to stay on without bubbles. Just beware when buying a renewed phone. I was fortunate and I was able to return it.",
            "rating": 3.0
        },
        {
            "name": "rfa",
            "location": "United States",
            "date": "September 19, 2024",
            "verified-purchase": true,
            "review-body": "I'm disappointed with the system Amazon uses to offer these devices at a discounted price.\nLuckily, I returned and purchased another one, which works flawlessly.\nHowever, after buying them, you have to inspect them. If they're defective (like my first attempt), you return them to UPS pick-up and wait 30 days for a refund.\nThis is for the vendor's protection, but it made me go around with phone calls and chats with UPS/Amazon. Why didn't they inspect the device correctly in the first place?????\nThey don't accept that you bring to UPS.\nSo you must be home waiting for UPS to pick it up, but what if you have to go to work ?????\nI lost two work days because UPS didn't show up on the first day.\nIt ended up well after so much trouble.\nSo, be ready to have some back-and-forth experiences.",
            "rating": 3.0
        },
        {
            "name": "David O",
            "location": "United States",
            "date": "December 23, 2024",
            "verified-purchase": true,
            "review-body": "Have had good luck previously with Amazon renewed items, but never with such a high-ticket item.\n\nThis renewed iPhone far exceeds expectations: The device looks absolutely new, and iOS showed only 5 battery cycles!\n\nDisplay is perfect in appearance and operation, no scratches / marks on case, display, or camera lenses.\n\nEverything works perfectly - at a fraction of what a new one cost!\n\nHighly recommended.\n\nWill update if anything changes.",
            "rating": 5.0
        },
        {
            "name": "Greenmeadows",
            "location": "United States",
            "date": "January 16, 2025",
            "verified-purchase": true,
            "review-body": "Bought two phones one for me and my wife. Both looked new. This one had very few charging cycles on the battery and wonder if was even used. Mine had over 400 charging cycles—not surprising since are renewed phones. Happy with both",
            "rating": 5.0
        },
        {
            "name": "Nata",
            "location": "United States",
            "date": "February 27, 2025",
            "verified-purchase": true,
            "review-body": "Love the phoneee",
            "rating": 5.0
        },
        {
            "name": "Jay Rutherford",
            "location": "United States",
            "date": "October 29, 2024",
            "verified-purchase": true,
            "review-body": "After years of owning Android cell phones and being frustrated at the many different implementations of Android, I finally decided to capitulate and switch to an iPhone. It seems like I can look up nearly anything I need to know about my iPhone 15 Pro Max and the answer works for my phone. It's a very pricey phone, even when renewed, but I find it worth it, particularly for the camera's features. Apple's very consistent approach to their software makes it easy to learn how to use the various features. I put the phone in a protective case complete with a sliding cover that protects the camera lenses and strongly recommend it.",
            "rating": 5.0
        },
        {
            "name": "Amazon Customer",
            "location": "United States",
            "date": "September 18, 2024",
            "verified-purchase": true,
            "review-body": "1tb blue 15 pro max - manufactured July 2023, first used September 2023, original battery, 63 cycle count, screen was replaced last December using genuine apple parts, small scuffs on the corners revealing the base metal. Not bad not great! I'll probably keep it unless I encounter performance issues.",
            "rating": 4.0
        },
        {
            "name": "Dylan",
            "location": "United States",
            "date": "August 16, 2024",
            "verified-purchase": true,
            "review-body": "I needed an iPhone on a budget and came across this. With it being almost $200 less than an iPhone from the Apple Store, I was intrigued. Upon purchasing it, I knew I was buying a refurbished phone and there was a chance there could be scratches or battery issues. When I received the phone it came in good packaging, with a charger, and with a certificate of functionality. I was thrilled by the packaging. After opening the phone and setting it up, I checked the battery health and it is still at 100% with only 10 total charges! The phone had not been opened either for any kind of repairs! Overall a great purchase if you are looking to get the iPhone 15 Pro Max cheaper. This was the renewed premium one that came unlocked!",
            "rating": 5.0
        },
        {
            "name": "Carle Todd",
            "location": "United States",
            "date": "December 15, 2024",
            "verified-purchase": true,
            "review-body": "Just received today. Phone came with a tempered glass screen protector installed already. Looks to be in pristine condition (purchased as premium), and has 100% battery health. Only thing I have noticed so far is the charging port keeps popping up that it’s charging but it could be my cord not the phone itself. I’ll have to do more investigating on that. But so far it seems excellent condition as described.",
            "rating": 5.0
        },
        {
            "name": "Kiersten",
            "location": "United States",
            "date": "October 4, 2024",
            "verified-purchase": true,
            "review-body": "The phone came without dents or scratches. Battery health is at 100. However, it did not come with a charging block so I don’t know what happened to it. Overall no problems with the phone.",
            "rating": 4.0
        },
        {
            "name": "kwar",
            "location": "United States",
            "date": "December 31, 2024",
            "verified-purchase": true,
            "review-body": "First time buying a nigh ticket item with Amazon.\nThis renewed iPhone exceeds expectations: The device looks absolutely new, and iOS showed 0 battery cycles and life of 100%! Display is perfect, no scratches / marks on case, display, or camera lenses.\nAdding to my existing plan (Xfinity mobile) was a breeze.\nHighly recommended.",
            "rating": 5.0
        },
        {
            "name": "Cano, Javier, Mr.",
            "location": "United States",
            "date": "February 18, 2025",
            "verified-purchase": true,
            "review-body": "It was as new",
            "rating": 5.0
        },
        {
            "name": "Edmond K",
            "location": "United States",
            "date": "February 17, 2025",
            "verified-purchase": true,
            "review-body": "Like new\nVery happy\n:)",
            "rating": 5.0
        },
        {
            "name": "Esteban",
            "location": "United States",
            "date": "February 20, 2025",
            "verified-purchase": true,
            "review-body": "Excelente producto",
            "rating": 5.0
        },
        {
            "name": "Reggie Ponder",
            "location": "United States",
            "date": "November 22, 2024",
            "verified-purchase": true,
            "review-body": "The iPhone 15 Pro Max is hands down the best phone I’ve ever owned! The design is sleek and lightweight, and the titanium build feels premium. The camera quality is incredible—photos and videos come out crystal clear, even in low light. Performance-wise, it’s lightning-fast, and apps run seamlessly without a hitch. Battery life is impressive, lasting me all day with heavy use. I love how immersive the display is, perfect for streaming and gaming. If you’re on the fence, go for it—this phone is worth every penny!",
            "rating": 5.0
        },
        {
            "name": "The Great One",
            "location": "United States",
            "date": "December 25, 2024",
            "verified-purchase": true,
            "review-body": "Samsung all day. But needed a new work phone so apple it is. Amazon sold me a used phone but you cant tell. The condition is EXCELLENT. Great price. No nicks or scratches or dings. All the pixels in the phone work perfectly. You couldnt tell me this wasnt new. Good job Amazon!",
            "rating": 5.0
        },
        {
            "name": "Mawa",
            "location": "United States",
            "date": "December 9, 2024",
            "verified-purchase": true,
            "review-body": "I honestly like the phone and it look nice, clean, and new. No scratches, even though the battery health is 94%, but it takes more that 3 hours and half to get fully charged. I am going to hand it for few weeks to see if the problem is about the phone or the cable charger otherwise I need to return it.",
            "rating": 3.0
        },
        {
            "name": "Raúl Medina",
            "location": "United States",
            "date": "December 24, 2024",
            "verified-purchase": true,
            "review-body": "El iPhone 15 Pro Max que me compré está en excelentes condiciones, tal cual como lo detalla Amazon en su categoría de Renewed Premium. El estado de la batería está con el 100% y la calidad de la pantalla impecable, así como la cámara y todo lo que ofrece este celular. Recomendado!!!",
            "rating": 5.0
        },
        {
            "name": "Sergio",
            "location": "United States",
            "date": "February 7, 2025",
            "verified-purchase": true,
            "review-body": "Reconditioned and it works just as good as a brand new one",
            "rating": 5.0
        },
        {
            "name": "iPhone 15 pro Max 512gb",
            "location": "United States",
            "date": "January 16, 2025",
            "verified-purchase": true,
            "review-body": "It’s have only a minimal scratches but the phone in my case have %100 battery life so that’s great, doesn’t come with the original usb-c cable but it’s great would recommend",
            "rating": 5.0
        },
        {
            "name": "J.E.S",
            "location": "United States",
            "date": "November 29, 2024",
            "verified-purchase": true,
            "review-body": "I upgraded from my 13 Pro Max to this phone , mainly because I wanted to fool around with apple intelligence and wanted the satellite communication and crash detection.\n\nThe phone looks brand new, the battery is at 100% and it was first installed in December 2023 and first use was January 2024, the phone isn’t even a year old yet!\n\nI really like this phone!",
            "rating": 5.0
        },
        {
            "name": "Makayla Chiasson",
            "location": "United States",
            "date": "September 6, 2024",
            "verified-purchase": true,
            "review-body": "This phone was absolutely flawless minus one tiny micro scratch on the screen you can’t see without a flashlight. The battery was basically brand new at 100% with only 15 charge cycles. I had no trouble setting up the phone. It was basically like buying a brand new iPhone directly from Apple. I’ve had no trouble with the performance doing day-to-day operations like a doom scrolling on TikTok or watching videos on YouTube. I’ve seen some bad reviews when it comes to buying Amazon certified refurbished however, this was an excellent value for the money as the phone was basically brand new.",
            "rating": 5.0
        },
        {
            "name": "Daniel Byfield",
            "location": "United States",
            "date": "January 9, 2025",
            "verified-purchase": true,
            "review-body": "Looks like i rolled another lucky 7.\nThis phone showed up brand new. like literally. hahaha. it was still within the first 8 months of its listed production date.\nSCORE!",
            "rating": 5.0
        },
        {
            "name": "Noel Alexander",
            "location": "United States",
            "date": "September 16, 2024",
            "verified-purchase": true,
            "review-body": "Great phone. I love everything about it. I just wish it came with a charging box and not just a cord. Other than that. No complaints",
            "rating": 4.0
        },
        {
            "name": "J Gillespie",
            "location": "United States",
            "date": "January 9, 2025",
            "verified-purchase": true,
            "review-body": "The phone I received was in \"As-new\" condition. it appears to be all original Apple parts, and the phone was manufactured in July 2025.\nSo far, no complaints.",
            "rating": 5.0
        },
        {
            "name": "Se ven bien . cómodos. Pero el lente no es del color que se muestra es mucho más claro",
            "location": "United States",
            "date": "August 29, 2024",
            "verified-purchase": true,
            "review-body": "Se ve bastante bien ‘ lo único que no trae cargador y en las especificaciones viene marcado que si lo trae . Ahora gastaré un poco más para poder comprar el cargador",
            "rating": 4.0
        },
        {
            "name": "andres franco hoyos",
            "location": "United States",
            "date": "February 13, 2025",
            "verified-purchase": true,
            "review-body": "Excelente",
            "rating": 5.0
        },
        {
            "name": "Eric & Tashina",
            "location": "United States",
            "date": "August 23, 2024",
            "verified-purchase": true,
            "review-body": "Had a few scratches in the glass of the display which you can’t see when I put a tempered protector on but should not reallly be there on a mint like new phone",
            "rating": 4.0
        },
        {
            "name": "Camerman Chicago",
            "location": "United States",
            "date": "January 7, 2025",
            "verified-purchase": true,
            "review-body": "The phone had 100 percent battery life and looks brand new. Saved hundreds and very happy with my purchase. I will definitely consider buying Renewed Premium again.",
            "rating": 5.0
        },
        {
            "name": "Shenell Harriott",
            "location": "United States",
            "date": "August 22, 2024",
            "verified-purchase": true,
            "review-body": "So this is my second time purchasing a renewed premium phone from Amazon. Although I wish it could’ve been lot less cheaper than the new, it still stands out. There may have been replacement on the camera, the battery health is 100 and it is really clean. No scratch, no dents, clean charging port. Buttons works perfectly phone performance is optimal right now. I love the phone so far. My previous renewed phone was 96 battery health which made me upgrade to this. If you watch TikTok you see them mention camera quality, believe them. Otherwise, phone kiss. I love it, 9/10.",
            "rating": 5.0
        },
        {
            "name": "KA",
            "location": "United States",
            "date": "January 17, 2025",
            "verified-purchase": true,
            "review-body": "I ordered Premium Refurbished one. The phone came in with 100% battery heath and no scratches whatsoever. Looks like a brand new",
            "rating": 5.0
        },
        {
            "name": "mdy38se",
            "location": "United States",
            "date": "January 31, 2025",
            "verified-purchase": true,
            "review-body": "Very good shipping service great product thanks",
            "rating": 5.0
        },
        {
            "name": "Diana C.",
            "location": "United States",
            "date": "November 6, 2024",
            "verified-purchase": true,
            "review-body": "I didn't go through all the hassel to see how many battery charges it went through and so forth. The iphone was in immaculate condition. They send me a charging cable, not original apple product but I am okay with that since I have other cables available. Not a scratch, ding or defect from what I can tell and have had no problems since I started using it!",
            "rating": 5.0
        },
        {
            "name": "De Vee",
            "location": "United States",
            "date": "January 6, 2025",
            "verified-purchase": true,
            "review-body": "Phone condition looked great but the battery capacity was only at 85% and some of the apps were erased",
            "rating": 3.0
        },
        {
            "name": "Nyawin",
            "location": "United States",
            "date": "December 11, 2024",
            "verified-purchase": true,
            "review-body": "This phone is in absolutely excellent condition without any scratches. Another good thing is that it has 100% battery health with only 2 cycle counts. So far so good. I found this to be a value-for-money deal.",
            "rating": 5.0
        },
        {
            "name": "Nancy",
            "location": "United States",
            "date": "September 26, 2024",
            "verified-purchase": true,
            "review-body": "Funciona bien, para el precio! Lo recomiendo",
            "rating": 4.0
        },
        {
            "name": "jason",
            "location": "United States",
            "date": "October 30, 2024",
            "verified-purchase": true,
            "review-body": "It’s my first iPhone l saved money on just buying the phone outright.. and even more money by going with this renewed phone . The phone was in perfect condition when it arrived not one scratch could not even tell that it was previously owned battery health was still at 100%. I’ve had it for a while now and works perfectly. I believe it one of the nicest phones I have owned",
            "rating": 5.0
        }
    ]
}