{
    "asin": "B0D897WH4K",
    "productName": "Bold K50 | 5G| 2024 | 3-Day Battery | Unlocked | 6.7” FHD+ 3D AMOLED | 256/8GB | Triple 64MP Camera | US Version | US Warranty | Purple",
    "reviews": [
        {
            "name": "Seawife2",
            "location": "United States",
            "date": "April 4, 2025",
            "verified-purchase": true,
            "review-body": "I have had Blu phones for the past 15 yrs. and I'm coming from the Blu G91s which is 3 yrs. old and still works fine but I wanted to upgrade to Android 14. OS upgrades in Blu phones are non-existent. This is the best yet. Stunning amoled display and all the bells and whistles you would get on the big boys.\nPROS: Beautiful amoled screen with edge to edge display, 60-120hz. refresh rate that is customizable. Bright enough to see on sunny day. Very light weight, my purse fells so much lighter now. Very snappy, fast. Charges 20-100% in 40 minutes. Lots of customization settings, but this is probably Android 14 features. Phone calls are very clear sounding.\nCONS: Transfering date from old phone does not work well using wired connection. Use bluetooth connection for transfering data and this is completed very quickly. Speakers are good for regular use, but would not listen to music on them. SIM tray is funky and hard to open. It did lose connection when I first installed SIM, but is ok after re-installing. Blu does not have OS updates at all, but does have security updates. Camera is ok, not stunning, but does have all the settings you would get on the expensive phones. No RAW, no image stabalization. Macro is useless. See attached photos. Phone came with a ton of bloatware, and an entire tray of games which can be erased. The large camera circle on back of phone is a bit concerning for scraching, etc. What were they thinking? Phone did get warm, not hot on initial charging, but now is not a problem at all.\nSo far I am thrilled with my new phone, and highly recommend for someone who doesn't want to spend top dollar but still get top perfermance and features.",
            "rating": 5.0
        },
        {
            "name": "Jere Jay (Jack Slapford) Hegstrom",
            "location": "United States",
            "date": "February 6, 2025",
            "verified-purchase": true,
            "review-body": "So first off I was skeptical of the price and what was coming with that price. Well long story short I couldn't be happier with this phone after one week of use. Beautiful big display, it feels very expensive, very high quality, it's fast, plays any game with ease, internet surfing is blazing fast. The camera for me is awesome, I'm not a camera freak but I do like a nice camera on my phone, for me this camera is way better than my last phone which broke, a razor+ 2024, that phone was decent but so far this phone is better in my mind. I've always had high end phones, this phone being $200 to me it's still high end, looks high end, feels high end and performs high end. The huge circle camera glass on the back scares me, I need a protector yesterday, as well as for the front, this phone feels like something you really want to protect, the case it came with is clear and I kinda like it, wish it came with a screen protector however. Anyway if I change my mind on how I feel about this phone I will update my review asap. Don't worry about this $200 price tag, this phone has it all, at least it does in my book... So far I highly recommend this BLU K50 BOLD.\nI wasn't expecting this much of a phone for the price, theres no reason why this phone isn't triple or quadruple the price?. I will update review if I feel differently asap...",
            "rating": 5.0
        },
        {
            "name": "Nicholas",
            "location": "United States",
            "date": "February 9, 2025",
            "verified-purchase": true,
            "review-body": "This is for the k50 from Blu, I have owned, or should I stay still on five or six blu phones, not because they stopped working, just because they're so affordable to upgrade. The cost of a blu phone is equivalent to your deductible on a higher end phone with warranty if the glass were to break. I have never had any issues with my BLU phones, if there's one thing that has happened that has made me go with the new phone, it was the battery started draining too quickly for my needs, that was after a year and a half of owning the phone. The only reason I upgraded to this K50 was because my old blu phone had Android 11 and was not being updated, this phone comes with Android 14, hopefully it will get one update as most Blu phones do. Not the phones issue, but I'm not a fan of Android 14 in the short time that I've had it, they say there was improvements, I say they just added more junk, couldn't leave well enough alone. The one disappointing part of this phone that almost all my other Blu phones have, is this does not have gorilla Glass. There is already three scratches in my screen and I've had this less than a month. My other blue phones, I do not have any scratches in the screen, and I am not one that cares about what's in my pocket with my phone, now I'll have to be cautious of what's in a pocket with this phone. That is a huge disappointment. I am not a fan of beveled screens, but I purchased a protective case that's edges sit just above the beveled screen, so no more accidentally hitting keys or items close to the edge of the screen. The screen is bright, brighter than most of the blu phones I've owned, it can be used in the Sun, it could be brighter however, where some of the blue phones have a hard time when the Sun is shining bright, that could be due to the gorilla Glass, and I'd rather have gorilla Glass and have to struggle to see my screen then be able to see my screen with scratches in it, just saying. As always the speaker on this phone is decent enough unless you're looking to jam out. The camera like all other blu phones is just okay, it's nice, it functions, but if you want to really really good camera you're going to spend $800 or more on the phone. I was a little disappointed in the extra apps that come on this phone, the one thing I always really enjoyed about the blu phones, was that it didn't come with the whole lot of apps pre-installed, very little in fact, this however came with seven or eight more than I'm used to, I don't know if that's an Android thing or blu looking to make money, either way it's not a deal breaker. This battery life does not seem as strong or as long-lasting as my other blu phones when new. As long as the battery stays strong for a year, there shouldn't be any issues, it lasts just long enough to make it the whole day for me. Set up is easy enough, it having Android 14 it's compatibility is fine. And it's connectivity is how it should be.\nI think if blue were to make a perfect phone they would really have to concentrate on the camera, really concentrate on the screen brightness outdoors and still having gorilla Glass, and work on their speakers if they can. If they addressed all that stuff even a notch or two I would pay over $200 for one of their phones.\nI highly recommend any blu phone, I've never Had an issue with them and as I said, I own six that all Still work just fine (over the course of 5 or 6 years)\nProduct arrived on time and packaged well. One more afterthought, all my BLU phones have always come with fantastic protective cases free in the box, this k50, came with a clear plastic cover, come on blu.\nRepeating myself, I am a huge fan of blu. For the money, they work, if it breaks in a year, you just replace it, it's outdated in a year, you just replace it, they're that affordable, why spend $1,000 on a phone, that you'll want to replace in a year anyways... I've never understood that.",
            "rating": 4.0
        },
        {
            "name": "aultraman",
            "location": "United States",
            "date": "March 28, 2025",
            "verified-purchase": true,
            "review-body": "Everything worked as expected and the phone was light and responsive. Finger print scanner and facial nonrecognition worked as expected.\n\nThe only problem I had with the phone was the battery drain too fast. I would charge it to 80%, and with the airplane mode on, the next morning it was down to 27%.\n\n3/30/25 update - I discovered the Libra 3 app was very draining in the background. So I closed it right after using it. This has dramatically improved battery usage. So now the battery drain overnight is about 15% point. I'd say this is borderline OK, but definitely not going to last 3 days. Realistically, I'd be happy with a 1.5 day use w/o charging.",
            "rating": 3.0
        },
        {
            "name": "kevin lawson",
            "location": "United States",
            "date": "September 3, 2024",
            "verified-purchase": true,
            "review-body": "I'm coming from a Blu G91 Pro which is a really good phone , but holy cow I wasn't expecting such a big leap in performance/ quality and how fast things could be . The face ID works almost too good because it's crazy fast and man the under the glass finger print sensor is equally impressive. This phone also has features my other phone just didn't have, like more camera features , more ram expansion and more things you can change or do. Also this phone is way brighter and with its 120Hz display which makes moving around very snappy. If your wondering about the display it's very crisp and I come from a phone that was 4g , but now with 5g I can run shows at a much higher resolution, 1080 no problem, even 4K no problem. Oh and if you like customization with your camera, well Blu has you covered, because all you gotta do is go into your camera pull down your settings and go into custom or you just have it where you can go with just more at the end with Pro features, Dual view video, macro ,group , slow motion, time lapse , AI and much more . Overall for $200 I can't imagine getting anything better , because you not only get a phone but a case , quick charge power brick and a cable . If that's not enough it has an edge display with edge lighting and a light on the back that can also do different things . I guess someone was saying this doesn't have a RAW mode , it does just go into Pro Mode and pull down from the top where you'll find extra features. Also Blu has great customer service and it blows my mind that people will complain without even trying to understand or do any kind of problem solving. So call Blu if you have a problem, like the guy who says his phone is too loud , but he just complains and complains never realizing it could be defective or something else . Maybe ask if that's normal , call Blu , do some research , because at the end of the day this is a $200 phone , not $1000 or $800 or even $500 , yet people will expect perfection and complain why it's not exactly like a $1299 Samsung phone . Oh and the person who left a one star and said Amazon/Blu said it's not their problem is BS , because I've never not once in all the years of using blu phones have I ever not had a great customer experience and they will replace your phone if you make sure and let them know it's unusable, not Amazon, Blu .",
            "rating": 5.0
        },
        {
            "name": "Fitness Enthusiast",
            "location": "United States",
            "date": "March 4, 2025",
            "verified-purchase": true,
            "review-body": "The BLU BOLD K50 5G is an excellent Android 14 smartphone with the most fantastic price point! 🌟 I'm utterly thrilled with it and have been using it nonstop since I bought it! I'm definitely a fan of BLU phones, and this version keeps me totally happy! 💯😁\n\nI wasn't planning on using the included \"BOLD\" headphones, but they work very well—the sound quality is better than expected! 🎧\n\nThe camera takes GREAT photos—I'm SO very pleased thus far! 🤩\n\nBefore fully using the BOLD K50, I recommend setting aside some quality time to customize all of its fabulous settings—the many options are super cool and helpful! 😀\n\nI have zero regrets in buying this phone, and I would absolutely purchase it again if needed! 🎉\n\n(No, I'm not getting any sort of kickback for this review. I just genuinely love my new BOLD K50! 😄)",
            "rating": 5.0
        },
        {
            "name": "L.",
            "location": "United States",
            "date": "March 6, 2025",
            "verified-purchase": true,
            "review-body": "The media could not be loaded.\nI'm never buying another phone from this company ever again. The startup/shutdown sound is loud enough to wake up the whole neighborhood. The volume control sucks! The minimum is set to 14%, which is as loud as 80% on a normal phone.\n\nIn order to listen to music I had to install an app with a precise volume control and set the volume to 5% (which is impossible to do without an app), whereas on a normal phone I'd have my volume set to 40% during the day, and 10% at night. I haven't yet tried the volume at night, but I hope 1% won't wake up the dead.\n\nThis smartphone is complete embarrassment when it comes to watching movies or listening to music, unless you're deaf.\n\nP.S. It's even worse with headphones. When I use them at 14% volume, it feels like a bomb exploding into my ears.\n\nUPDATE:\nThis phone is an even worse nightmare than I thought. In order to disable the noisy system sounds I have to keep it on mute, but this also disables my phone ringtone, which means I CANNOT hear when someone is calling me!!! Isn't it common sense to separate toggles between useless system sounds and phone ringtone? I guess common sense isn't so common in some companies.\n\nAnd 1% is still too loud for watching/listening to anything at night. I'd be returning this piece of crap as soon as I get another smartphone in my mailbox.",
            "rating": 1.0
        },
        {
            "name": "Mi'Lyn",
            "location": "United States",
            "date": "March 18, 2025",
            "verified-purchase": true,
            "review-body": "I Love this phone! This phone is adorable,stylish unlocked,large screen size super fast charging.I had no problem using it with t mobile/mint carrier. The camera is ok. You will notice some nice items during your unboxing. If you want a great phone that is affordable this is it .",
            "rating": 5.0
        },
        {
            "name": "AMZSQ",
            "location": "United States",
            "date": "August 15, 2024",
            "verified-purchase": true,
            "review-body": "Not my first BLU phone but my first Bold, not a bad option considering whats currently available. My last phone was a BLU F91 5G, which if it was still available I would have just bought another. I can't reconcile mentally why there is no wireless charging. Seriously, all the reasonably priced options don't have it any longer. The only reason I \"upgraded\" was because the battery in my old phone got hot enough to off gas and blow the back of the case off on my old phone so I did not have a ton of time to wait around looking for a new phone.\n\nI have been using this phone for a week and here are all the things I have noticed so far.\n\n1. It does have a dual sim card slot, but an odd one. Its on the bottom of the phone, and very difficult to get out even with the tool they provided, it took a bit of a hook to get it out. Its thicker than usual and the sim card kind of snaps in, because its double sided. You put one card facing out on the top and bottom, new to me after having dozens of phones. Nowhere could I find if it was dual sim in the documentation (Sim1 is on top).\n\n2. Its big enough storage to justify not having an SD card slot. I know nobody is doing it these days, but I have had more phones die than SD cards and a good waterproof SD card can save the day if you have a whole trips worth of pictures on the phone when you dunk it hard enough to kill the phone. But, with 256GB its got enough storage for all my MP3's and lots of pictures (I travel a lot and am on the water often where I have no service but want to be able to have music on board) plus all my apps. There was a bunch of unnecessary bloatware but not terrible and it was easy to clean up. I am at 41% used before I start taking pictures so its a bit dicey for long term usage.\n\n3. The onboard storage is slow. Unbearably slow. Transferring my files from my Windows or Unix PC was maddeningly slow, regardless of USB cable or which port I used. These are the same devices and cables I use for my old phone as well as an even older BLU G91 Pro and they are both 100 times faster to copy files over USB either to the SD card or the internal storage. It was so slow and unusable that I had to try multiple cables and ports before giving up on moving my MP3's over by USB and installing an FTP client on my phone. That was the only way I could move anything more than a few small files on or off the phone. Its something that I can overcome but its maddening.\n\n4. It came with a screen protector on it. Its good because there are not a lot of options yet, but I didn't see that anywhere.\n\n5. The case it comes with is laughable and there are not many options currently and you never know if there ever will be. Honestly for this to be in the Bold line and not have a better case than this is a bit odd. My last 2 phones had the black lightly armored cases that were good enough not to need an upgrade, this one is going back a few years and its a throw away if you can find something better. The first one I have tried doesn't even come close to having the right openings for this phone even if it fits the general form factor and camera lens so if you need a decent case maybe this is not the right phone for you.\n\n6. The fingerprint scanner is adequate but not great. Its in the screen which is the new hottness, but it doesn't work as well as my last several low end phones. I have 7 or 8 fingerprints registered to try and help my two fingers work but I have to hold it just right to get it to unlock. It works and I am getting used to it but the back panel and power button scanners both work better for me.\n\n7. Battery life is fantastic and it charges well. It does take a bit more power to do a fast charge but it is very fast and the battery easily lasts me all day. No complaints at all, other than damn I wish it had wireless charging, I mean its 2024 and many, many cars have wireless charging and it would be great to be able to use it. I know it adds heat and I wouldn't really use it in the summer and its not that fast but if you are driving its nice to just keep it topped off if you don't want to deal with wires.\n\n8. The screen is just lovely. I really should have lead with this. its the nicest looking screen I have every used, and its very bright and very clear. It is so easy to read I might be in the market for a second one because my wife's phone screen is terrible compared to this one.\n\n9. Its fast enough most of the time. Fastest phone I have ever had, very responsive nearly all the time. The ram is plenty for an old dude who has way to much open and way to many notifications all the time. The only thing slow so far is the camera, and I wonder if its because the storage is slow. That sucks for me, I have missed several candid shots already and experience has told me this is as fast as the phone will get. I am going to have to slow down myself and see if lowering the resolution will help but as of now the shutter speed is slow enough I have taken several pictures of my feet. I have only taken few a dozen pictures and a couple videos, and while they look really really good on the screen I haven't tried them on a big screen yet. The camera would also benefit from some form of stabilization but it works well enough for the price point from a quality standpoint.\n\nOverall its a good phone, I wish it had a decent case, and faster camera and storage. It wouldn't hurt to have an SD card slot. It still sucks to not have wireless charging. I hope BLU brings that one back. Its a great phone to look at and feels good in my hand and for the price its very good.",
            "rating": 4.0
        },
        {
            "name": "Patricia L Woodgate",
            "location": "United States",
            "date": "April 8, 2025",
            "verified-purchase": true,
            "review-body": "I love blu. This is about my sixth one. Everything is so easy to figure out on this thing it's like a family member. And yes a lot of the family has them too. a lot of new things to figure out on this and it works so fast. Everything connected well smartphone, car, thermostat, TVs, printer, and the laptop. None of them are manufactured by blue but somehow they manage to connect well with anything! The toughest was my smartphone that was from China. Unbelievable low cost to receive so much;-)",
            "rating": 5.0
        },
        {
            "name": "Shopper",
            "location": "United States",
            "date": "March 15, 2025",
            "verified-purchase": true,
            "review-body": "I Love Blu Phones. I needed to get a new one because my old one was not 4g compatible. I did not realize there are issues with Blu & Certain carriers. I went through a lot of trouble finding a carrier for my phone. It is not esim capable, and requires a physical sim card. Be sure to check that it will work with your carrier. The phone itself is Awesome & FAST, Faster then every phone I've compared it to. It holds a ton and you don't have to worry about it slowing down.",
            "rating": 4.0
        },
        {
            "name": "Voyager",
            "location": "United States",
            "date": "September 16, 2024",
            "verified-purchase": true,
            "review-body": "And to think I hesitated..I'm glad I pulled the trigger and made the purchase. BLU has stepped their game up and designed a very nice device with the K50. I've been using the Moto Stylus 2024 since launch and I put it down to try this jem out. Unboxing reveled the device, clear case, wired usb-c ear buds, charger & cable, sim tool, literature and a sticker. The phone in an easy on eyes (minding the Large camera bump) purple and feels good in hand. The Large curved screen has good reachability (for larger hands) with a preinstalled screen protector. The phone did get very warm during the Initial bootup and data transfer. No worries though as the process went quickly and flawlessly. I'm using T-Mobile and getting very strong 5G UC connection with great up/down speeds. Call quality and earpiece are good although using the speakerphone isn't the best do to the lackluster single bottom firing speaker. Concerning the main speaker, it's sufficient for notifications and tones, but music and voice imo gets a thumbs down. There's no traditional headphone jack, instead it's incorporated into the charge port. I haven't tested the included Apple esq buds as I've paired my Galaxy buds2. Android auto works as expected and Bluetooth connectivity is fast using my UConnect system. Ive also paired up to my Wyze watch 47c with no issues. A few other notable likes are: Breathable light (rear notification reminder) Side swipe sidebar for apps (similar to Samsung)\nFront and rear camera and video quality minus the zoom and video EIS. Fast In screen fingerprint reader\n256 GB onboard storage despite the lack of SD support.\nI uninstalled and disabled all of the bloatware and offers which there wasn't that many of. Battery life is exceptional under normal usage and I was able to get from 20 - 100% charge in 45min using the included brick. I'm not a mobile gamer but I did test Steam link and was able to play Starfield, Fallout 4 and Shadow of the Tomb Raider at 1080 with no issues including heating.\nThere is an initial general software for August 2024 security update, it's unclear to me how many software and or security updates will be released for this device. A few cons: The curved screen can allow for unwanted gestures, screen brightness in sunny conditions, no tap to wake screen, although has lift to wake. No SD card support, no stereo speakers and a bad quality primary speaker. Included case will yellow and is flimsy so an aftermarket case is advised.\nAside from a few beef's I can easily recommend this an everyday device.",
            "rating": 4.0
        },
        {
            "name": "LRo",
            "location": "United States",
            "date": "March 13, 2025",
            "verified-purchase": true,
            "review-body": "Fantastic Phone! This is my 4th or 5th BLU phone and they just keep getting better! Love the dual sim, resolution, intuitive functions, cameras, battery life, etc... I'm super happy with this phone! Only complaint: I wish they'd bring back the ability to record a call. Older models had a record button you could push when on the phone. If businesses can record calls, I should be able to also. *Dual sim is the top and bottom of what looks like a singular sim slot. You have to flip it over to insert the 2nd sim.\nCustomer service has historically not been good but you won't likely need it with this phone.",
            "rating": 5.0
        },
        {
            "name": "Cortni",
            "location": "United States",
            "date": "March 16, 2025",
            "verified-purchase": true,
            "review-body": "I like the camera and pretty much everything, but reception is not great. It also isn't super durable. But as a whole it isn't bad. It is better as a phone than many options, but I needed better reception and to keep connected to Bluetooth.",
            "rating": 4.0
        },
        {
            "name": "Austin",
            "location": "United States",
            "date": "March 30, 2025",
            "verified-purchase": true,
            "review-body": "Volume lowering button doesn't work, otherwise great phone for the price",
            "rating": 4.0
        },
        {
            "name": "Chi",
            "location": "United States",
            "date": "December 16, 2024",
            "verified-purchase": true,
            "review-body": "This my 7th BLU phone and 1st 5G phone. So far so good.\nAlways got 5G signal with my carrier(T-Mobile), one time 4G signal when I was in Vegas. No interrupt when watching YouTube.\nFast charging time(less than 2 hours for a full charge), can use at least 1 day for watching YouTube.\nBLU phones always come with every things in the box, but this time no screen protector, maybe because the curve edge?\nThe plastic case is banded at the lower volume bottom(see picture) that would cause the problem to press the lower volume button(need to press couple times to make a screenshot).\nThis phone is not a wireless charging phone.\nOverall this is a good phone so far.\nI am a loyalty customer of BLU, all the BLU phones I used before DIED because the USB socket was not functioning and couldn't be charged. I am trying not to use the phone when charging in the future and I hope I can use it longer.\nAlso, I am going to order another 5G BLU phone (F5) for $99, I think it worth it!",
            "rating": 4.0
        },
        {
            "name": "Amazon Customer",
            "location": "United States",
            "date": "March 10, 2025",
            "verified-purchase": true,
            "review-body": "Still trying to learn this new phone as it is just amazing how different it functions compared to my old android phone. One item that is really weird regarding this phone, the dial push buttons numbers for making a call are only numbers (no corresponding letters). I have never seen a phone made like this where the alphabet letters are not listed with the corresponding numbers for dialing or entering a pass code. Basically if you need to input any pass-codes on this phone when you are calling someone (opening your phone without using fingerprint or facial recognition but a pass code), and you need to press the phone button numbers, you better remember what letters correspond with each number as this phone doesn't show the corresponding letters of the alphabet and that is kind of a bummer. Why Blu would you make a phone like this? Only 3 stars because of this.",
            "rating": 3.0
        },
        {
            "name": "Kindle CustomerEL VEGO",
            "location": "United States",
            "date": "February 11, 2025",
            "verified-purchase": true,
            "review-body": "Packed with features and Android 14, everything works well. Brilliant screen, good sound and fast responses. And the phone is loud and clear. Nothing bad about it, it's a bargain for the price.",
            "rating": 4.0
        },
        {
            "name": "Rafael Luna",
            "location": "United States",
            "date": "April 7, 2025",
            "verified-purchase": true,
            "review-body": "Muy buen teléfono me encanta",
            "rating": 5.0
        },
        {
            "name": "Amma",
            "location": "United States",
            "date": "February 2, 2025",
            "verified-purchase": true,
            "review-body": "Nice but lacks quality stereo sound and the camera gives blurry pics.",
            "rating": 4.0
        },
        {
            "name": "Emily Myer",
            "location": "United States",
            "date": "March 29, 2025",
            "verified-purchase": true,
            "review-body": "Saved my phone many times!",
            "rating": 5.0
        },
        {
            "name": "Woobr1",
            "location": "United States",
            "date": "December 18, 2024",
            "verified-purchase": true,
            "review-body": "Decent phone light great screen have numerous Blu phones G9 G9 pro g91 pro g91 g91 Max studio so I do know what I'm talking about when I talk about Blu phones the k50 does not have wireless charging other than that everything is great, it'd be five stars if they had wireless charging on the phone",
            "rating": 4.0
        },
        {
            "name": "Amazon Customer",
            "location": "United States",
            "date": "April 2, 2025",
            "verified-purchase": true,
            "review-body": "Good phone for the price however the haptic vibration feedback isn't very good at all. There is SO much bloatware and apps I didn't want pre-installed on the phone. Camera/Video recording is ok. The battery drains pretty fast but should last you a day. Auto-brightness goes way too low/dark on the screen. The curved screen edges are annoying.",
            "rating": 3.0
        },
        {
            "name": "DALE",
            "location": "United States",
            "date": "March 23, 2025",
            "verified-purchase": true,
            "review-body": "Super fast, inexpensive, nice display 👌",
            "rating": 5.0
        },
        {
            "name": "Christina M. Anderson",
            "location": "United States",
            "date": "September 13, 2024",
            "verified-purchase": true,
            "review-body": "I wanted to love this phone for the price. I've had Blu phones as recently as 2020 and they did exactly what I needed them to do, and were always comparable to the Galaxy S series phones.\n\nThat being said, I was looking for a newer phone because my Galaxy S21 has a few weird glitches going on that annoy me (screen turning a green hue, a weird line across the screen) and the newest S24 is not currently in the budget.\n\nSetting up the Bold K50 today was a bad experience from start to finish. The phone feels cheap right out of the box. It's not as wide as my S21 and probably weighs half as much.\n\nThe cable wouldn't \"stay connected\" to copy over my data -- despite the cable still being physically connected. So my call history and text history didn't come over.\n\nNo big deal, right? I can find an app to do that later.\n\nThen, I was asked to download a bunch of fluffy games as part of the setup. Again, not a huge deal, I'll just say no to all of that.\n\nTHEN when I finally get into the phone, there are a bunch of apps I've never downloaded (PlutoTV, Texaco, Chevron, just to name a few) and I had to delete them all. Plus an additional page full of app \"games\" that I'd rather not just be right there on my phone without my permission.\n\nAfter that, I couldn't seem to delete a folder on the home page, no matter how hard I tried. My only options were to view it bigger or smaller, but I couldn't actually remove or delete it, even when the folder was empty.\n\nThe final straw for me was the camera. It's probably okay quality but the camera takes incredibly small photos as compared to my S21. On the S21, the photo is the whole screen. Which admittedly probably isn't a normal photo shape (like not 4x6, for example) but it's what I'm used to and what I'm now looking for.\n\nOn top of that, the K50 doesn't have a zoom *out* feature which is one I actually use quite a lot.\n\nSure, some of this could have been things to expect or that I could have read about in the specs, and maybe that means I didn't look hard enough/shouldn't have purchased this phone. My success with Blu phones in the past led me to believe this one would hold up to AT LEAST a 3 year/version old Galaxy but the S21 blows it out of the water.\n\nI started setup about an hour ago, and I've already switched back to my S21 and will be returning this phone. Hopefully the S24 goes on sale for Black Friday and I'll make a new purchase then.",
            "rating": 2.0
        },
        {
            "name": "Dee Clay",
            "location": "United States",
            "date": "October 28, 2024",
            "verified-purchase": true,
            "review-body": "Blu has always been my go-to phone company I've had pretty decent luck with their phones except after about 4 years they don't want to charge anymore. This one is also a great phone so far so good. The only small Minor detail that I have that I wasn't too happy about as it said this phone is purple. The phone I received is definitely not purple more of a dark navy blue. But if that's the only issue then hey this is a great phone and I love it highly recommend it",
            "rating": 4.0
        },
        {
            "name": "yesdrs13",
            "location": "United States",
            "date": "November 19, 2024",
            "verified-purchase": true,
            "review-body": "I had to give up my BLU F91 5G phone which was a great phone, but, sadly, the back part started coming off and the only thing keeping it together was the protective cover. Nevertheless, I wanted to get a new cell phone and BLU's newest phone caught my eye, the K50. I was a little disappointed in 2 things that this phone didn't have like my F91. 1-No headphone jack... (But I purchased separately a patch cord that converts a USB-C to a headphone jack... problem solved) and 2-No SD card storage... (My F91 had a slot for it but only went to 128GB and also had 128GB internal storage. This phone did not have any SD storage but had double the internal storage (256GB) and if I need to backup, I just do it with my computer before making any massive changes... problem solved). Other than these 2 annoyances which were solved, the phone is extremely fast and performs very well. No issues at all with it's functions, except I have to get used to Android 14 coming from Android 11.",
            "rating": 5.0
        },
        {
            "name": "Jacob",
            "location": "United States",
            "date": "November 25, 2024",
            "verified-purchase": true,
            "review-body": "Night this for my 16 year old son and he said the sound is kinda wonky. The slightest touch of the button and the sound jumps up or down. He likes the quality of everything else, though. May not be a pixel or iPhone, but the camera quality is to his satisfaction.",
            "rating": 4.0
        },
        {
            "name": "Mickel Allen",
            "location": "United States",
            "date": "April 2, 2025",
            "verified-purchase": true,
            "review-body": "It's ok not outstanding as I thought it would be. Sometimes it freezes up on me so not sure what's the issue",
            "rating": 3.0
        },
        {
            "name": "alfredocat",
            "location": "United States",
            "date": "December 2, 2024",
            "verified-purchase": true,
            "review-body": "The camera lens was a concern. I hesitated to buy this one. I am more satisfied with the finger print security than with the G84. I ONLY BUY BLU PRODUCTS WHEN IT COMES TO PHONES.\nThe accessories are more available for this phone than the G84. It's fast, and more stable than the G84. I will keep that one for back up. I'm a senior citizen. I don't do social media. I text and take pictures and call my grandkids. It's handy when I am in the hospital. The battery last a very long time. It's large enough to set the icons and fonts to a large setting. I have bad eyesight. I only do the basics, it's very easy to use. I can hear clear when talking on the phone. I fall sometimes, the lens I worry about. That is my fault not the phone. It looks expensive much like the Top brands. BLU, Bold is affordable.",
            "rating": 5.0
        },
        {
            "name": "SMcN",
            "location": "United States",
            "date": "October 10, 2024",
            "verified-purchase": true,
            "review-body": "I recently travel out town and had to use maps to find my way around the city I was visiting. The first day I ran out of battery around 3pm, leaving me in a precarious situation unable to find a way back home. I tried to use the wireless charger that I had with me but to my surprise this phone doesn't support wireless charging. This is a step back from my old F91 that had the wireless charging function.\nThe second day I had to lower the screen resolution to the minimum and activate battery saver as soon as I left the house to continue exploring the city. The battery lasted a little longer allowing me to get back to the train station and home.\nFor a brand new, flag ship phone, is a disapointment to have the battery life soo poor and no wireless charging function.\nEven with normal usage the battery doesn't last long. By the end of the day I am at 25% tops with normal usage.\nI am a fan of blue products but this one is a disapointment based on the company's clain of 3 days of battery life.",
            "rating": 3.0
        },
        {
            "name": "Paula S.",
            "location": "United States",
            "date": "October 20, 2024",
            "verified-purchase": true,
            "review-body": "This is by far the best phone I've owned (or even used) since my Samsung Galaxy Note 10+. Aside from the fact that it doesn't have a stylus, there really isn't much difference between the two. I noticed the speed and stability of the K50s performance the minute I first booted it up. It's fast as hell. Apps download in just under two seconds, games play smoothly with no lag, and movies stream with zero buffering. The screen resolution is sharp and vibrant, the battery charges quickly and is long lasting, and it takes absolutely phenomenal photos. I think, despite the sometimes poor reputation of the company, the Bold K50 puts Blu on a straight path towards redemption.\n\nIF I had to find some sort of negative aspect about this phone, it would probably be the screen. As much as I love the infinity display and curved screen, this one is very touchy along the edges, so you have to be careful with how you hold the phone in your hand if it doesn't have a case on it (which will probably be more often than you think because the case options for this phone are INCREDIBLY limited).",
            "rating": 5.0
        },
        {
            "name": "1AE3",
            "location": "United States",
            "date": "October 10, 2024",
            "verified-purchase": true,
            "review-body": "The technical specs on this phone are good for the price but I have to wonder why Blu allowed the foreign manufacturer to leave locked apps that I consider malware on this phone. First, this phone is being sold outright so there's no justification to have the PayJoy app on this phone since the app's function is to allow carriers to lock down a phone being financed if a user stops paying. A well known malware app, Aura appservices (not to be confused with the Aura security app on Google Play), is installed and will download unwanted apps daily (from China?). There are a number of non-Google Android system apps that all start \"com.pri\" not \"com.google\" that I worry phone home to China. At least the bootloader on this phone\ncan be unlocked, which means, in theory, I should be able to root it and remove these unwanted, locked apps with adb. Blu, I applaud you for making affordable phones with decent specs available, but your customer base wants security too. Please scrutinize apps your vendors want to install during your QA process.",
            "rating": 3.0
        },
        {
            "name": "PrecisionLinux",
            "location": "United States",
            "date": "December 16, 2024",
            "verified-purchase": true,
            "review-body": "I have been buying Blu phones for a few years now. I always get a great phone at an extremely competitive price. Not a fan of the finger print sensor on the power button, however. The K50 has an on screen reader. Absolutely awesome. I also decided to go with tap to pay which works flawlessly on the K50. Curved edges. Great quality. Excellent display. Great memory (at least for my needs). And fits perfectly in my hand with the perfect weight. And an up to date Android 14. Very comparable to another popular phone that's $800 more for exactly the same features. BLU has not let me down. Highly recommended.",
            "rating": 5.0
        },
        {
            "name": "tilzey",
            "location": "United States",
            "date": "October 23, 2024",
            "verified-purchase": true,
            "review-body": "I have owned BLU phones from the first time they were available on Amazon. That is years of using BLU/BOLD phones. I found them to be reliable and functional for the time I used them. I am always interested in the next new 5G phone from BLU, and now I have it.\nI find that the BOLD K50 is ideal for me. Lightweight, slim, responsive, fast 5G.\nEvery function I need is on this phone. I usually have plenty of battery left at the end of the day, unless I listened to a book for a few hours. The camera is fine for all I've asked of it. Volume is adequate for\nmy normal hearing. Included headphones work well. And best of all, I can charge this phone with my laptop's charger since they share the same type of connector.",
            "rating": 5.0
        },
        {
            "name": "Mariano Dieguez",
            "location": "United States",
            "date": "December 14, 2024",
            "verified-purchase": true,
            "review-body": "Excelente todo",
            "rating": 4.0
        },
        {
            "name": "wagner",
            "location": "United States",
            "date": "January 10, 2025",
            "verified-purchase": true,
            "review-body": "I have been a Blu phone user for years. This is the best one yet IMO. It is light but still has a large screen. Protector is also very light but solid making it much easier to carry around in pocket. Screen resolution and camera are very good compared to some of the prior higher ended models by Blu. You won't be dissappointed.",
            "rating": 5.0
        },
        {
            "name": "Matthew Scot",
            "location": "United States",
            "date": "October 23, 2024",
            "verified-purchase": true,
            "review-body": "Loaded everything right up and got my apps and media transferred over within an hour. Problem is, it should have taken five seconds. I have all of that on an SD card. The Blu Bold K50 does not have an SD card, only a SIM. -1 Star.\n\nPhone shipped with low battery, put it on the wireless charger. NO WIRELESS CHARGING. That is the worst. -1 Star.\n\nAndroid 14, Plus 1 Star. This is a good OS.\nSUPER FAST. This phone is fast and responsive. Plus 1 Star.\nScreen. AMOLED i have missed you. Plus 1 Star.\n\nThis manufacture needs to list things like lack of sd card or wireless charging. These are features I expect from a phone.",
            "rating": 3.0
        },
        {
            "name": "Crims0nTid3r",
            "location": "United States",
            "date": "January 21, 2025",
            "verified-purchase": true,
            "review-body": "This phone does everything I need it for. Great 5G connection and speed. Love the vividness of the display. It is much lighter than my Pixel 7. Except for some of the Pixel specific bells and whistles, this is a great replacement.\nAggravating the phone case doesn't quite fit right.",
            "rating": 5.0
        },
        {
            "name": "Jr",
            "location": "United States",
            "date": "January 12, 2025",
            "verified-purchase": true,
            "review-body": "Quiero empezar diciendo que el teléfono es mejor de lo que esperaba por eso 5 estrellas. Respecto a Servicio al cliente los nombreo por que me ayudaron mucho con mi pedido ya que hubo un problema con el reparto, y lo solucionaron lo más rápido posible. Muy agradecido con ellos.",
            "rating": 5.0
        },
        {
            "name": "C-36",
            "location": "United States",
            "date": "October 10, 2024",
            "verified-purchase": true,
            "review-body": "This phone is fast, reliable, sleek, simple, and honestly amazing. I have have iPhones, Samsung ZFlip s, Galaxies, all of the above and legit this phone is the best one I've used in a very long time. I'm also very critical when I review, so like, yeah, this phone is a beast. It's worth trying, the price is unbeatable and between the battery life lasting on a charge for like 2/3 days at a time, the touch screen ease, sound options and quality, and the storage being expensive via cloud while already being massive, this phone is the answer. For real, buy this one. It's 100% worth it. $1000 phone quality for $200. #GameChanger",
            "rating": 5.0
        },
        {
            "name": "Amazon Customer",
            "location": "United States",
            "date": "September 15, 2024",
            "verified-purchase": true,
            "review-body": "Received my phone from Amazon, a few days ago. The phone ran warm when first set up. However after I did the phone system update, the phone no longer runs warm. I also removed the clear screen protector; never cared for these on any phone that I've owned. The screen (display) is beautiful, bright, and crystal clear. And the speed and smoothness of any of the apps that I use, is fantastic. (I don't play games so I can't comment on that aspect of the phone.) Overall I'm very satisfied with my purcchase of this phone. For $200, I highly recommend it to anyone that want's a nice phone, without having to spend a lot of money.",
            "rating": 5.0
        },
        {
            "name": "Doug S.",
            "location": "United States",
            "date": "January 19, 2025",
            "verified-purchase": true,
            "review-body": "Absolutely love this phone. It's fast, has a great camera, and the screen is beautiful. Lacks wireless charging and stereo speaker but those aren't deal breakers for me at all. For the price this phone is definitely worth it.",
            "rating": 5.0
        },
        {
            "name": "Bob S",
            "location": "United States",
            "date": "January 22, 2025",
            "verified-purchase": true,
            "review-body": "BLU/Bold phones are not what they use to be, cheaper every year.",
            "rating": 3.0
        },
        {
            "name": "MIGUEL SANCHEZ",
            "location": "United States",
            "date": "December 7, 2024",
            "verified-purchase": true,
            "review-body": "Estoy acostumbrado a usar la marca, pero con este no cumplió mis expectativas, no tiene carga inalámbrica, el sensor de huella es en pantalla y mi antiguo Blu lo tenía en lateral, el procesador no cumple, y no uso juego demandante.",
            "rating": 3.0
        },
        {
            "name": "Fabrizio Antonelli",
            "location": "United States",
            "date": "January 24, 2025",
            "verified-purchase": true,
            "review-body": "Flag ship premium feeling, a very good value phone. Strong wifi and 5G signal. Screen quality is superb. Battery life if good.",
            "rating": 5.0
        },
        {
            "name": "Will s.",
            "location": "United States",
            "date": "November 22, 2024",
            "verified-purchase": true,
            "review-body": "So far this phone has had no issues. It's very fast. Crystal clear and very responsive to touch. Running on android 14. And full of features I'm still finding out. And battery life is more than I expected. With plenty of memory. Hopefully I can get another for my fiance seeing she got me to switch over to android 10/10",
            "rating": 5.0
        },
        {
            "name": "Andy Phuong Nguyen",
            "location": "United States",
            "date": "November 10, 2024",
            "verified-purchase": true,
            "review-body": "The phone meets my expectation. It can do most of daily work: web surfing, maps, email, music and some games. But the battery may not last as long as advertised. I need to charge the phone almost everyday. The fast charge makes it a bit easier though.",
            "rating": 3.0
        },
        {
            "name": "Fernando Acosta",
            "location": "United States",
            "date": "December 21, 2024",
            "verified-purchase": true,
            "review-body": "Funciona perfectamente. Muy rapida respuesta y facil configuracion. Compre protector de pantalla, pero ya traia uno que no estaba indicado. La carga de la bateria es muy rapida y dura mucho tiempo.",
            "rating": 5.0
        },
        {
            "name": "Michael A. Bingham",
            "location": "United States",
            "date": "December 12, 2024",
            "verified-purchase": true,
            "review-body": "Not perfect but good enough for the price. Nice screen. A little slow to download. On/off power button in bad location and turning off phone is complicated. Dual speakers would be nice. And a larger processor chip would be awesome.",
            "rating": 5.0
        },
        {
            "name": "Corey",
            "location": "United States",
            "date": "November 16, 2024",
            "verified-purchase": true,
            "review-body": "This is a great phone for the price. I broke my phone and I would have to pay at least 259$ for a phone with these options. The phone is so thin, thin like the s24. The screen is bright and the button are quickly responsive. Super happy with this phone, and it comes with a case....fyi",
            "rating": 5.0
        },
        {
            "name": "S Robert Bogle Jr",
            "location": "United States",
            "date": "January 24, 2025",
            "verified-purchase": true,
            "review-body": "Best Blu phone I've had. I have had several models before.",
            "rating": 5.0
        },
        {
            "name": "Jonathan Morrison",
            "location": "United States",
            "date": "February 1, 2025",
            "verified-purchase": true,
            "review-body": "👍",
            "rating": 5.0
        },
        {
            "name": "Amazon Customer",
            "location": "United States",
            "date": "November 18, 2024",
            "verified-purchase": true,
            "review-body": "SIM cards are kind of antiquated and inconvenient. Nicer to just connect to the new service, not wait one or two days for a SIM to arrive. So make sure you order your SIM with the phone so your service is ready to go when you get it.",
            "rating": 5.0
        },
        {
            "name": "tien phan",
            "location": "United States",
            "date": "August 2, 2024",
            "verified-purchase": true,
            "review-body": "This is a very nice phone in quality, screen Super AMOLED. Ram makes it snappy. Decent camera and decent audio. But the two issues for me that makes it not one to keep are heat, and no optical image stabilization. The phone gets a bit warmer than my other phone and that isn't good. The other issue is there is no OIS during video capture, and that is a big flaw for me. But for $199, I think it's a steal for a new 2024 BLU phone.",
            "rating": 3.0
        },
        {
            "name": "Noy Ruiz",
            "location": "United States",
            "date": "January 25, 2025",
            "verified-purchase": true,
            "review-body": "good👍👍👍",
            "rating": 5.0
        },
        {
            "name": "michele",
            "location": "United States",
            "date": "September 13, 2024",
            "verified-purchase": true,
            "review-body": "I like the different things that the phone has on it compared to my old g9 pro. So far I hate the speaker and I can't hear people on the phone. I wish they had something to boost the sound so you could hear that person talking. It not loud enough. Unlike my old phone the speaker is better and I can hear the person on the phone. I don't like the fact there's not a lot of good cases for it. Does anyone else have problems with hearing people talk. I don't like the fact it doesn't have a SD card slot but I can adjust to it. I don't like that it has been lagging since I got it yesterday day. I do like the different features it has than my old phone. It is a little to long to hold. So far it doesn't have a ghost in it unlike my old phone. So far that's what I hate and like about it.",
            "rating": 2.0
        },
        {
            "name": "David Spade",
            "location": "United States",
            "date": "March 19, 2025",
            "verified-purchase": true,
            "review-body": "Phone functions well but it gets very hot and mine has a small melted spot on the screen from the heat but continues to work. It's a great phone if they can solve the overheating problem.",
            "rating": 2.0
        },
        {
            "name": "Carlos",
            "location": "United States",
            "date": "December 8, 2024",
            "verified-purchase": true,
            "review-body": "Purchased for my wife, I have the older N3 and so far it's fantastic, the K30 is faster better picture. Either way N3 and K30 are great phones.",
            "rating": 5.0
        },
        {
            "name": "Deon Taylor",
            "location": "United States",
            "date": "September 23, 2024",
            "verified-purchase": true,
            "review-body": "This phone is amazing for the price. Charges fast, clear calls, plenty of memory, and looks great. Phones like this make buying flagship phones for over a grand insane! I text and email all day for work and this phone has been incredibly reliable. Camera is more than adequate and the price is unbeatable!",
            "rating": 5.0
        },
        {
            "name": "Lex",
            "location": "United States",
            "date": "March 24, 2025",
            "verified-purchase": true,
            "review-body": "The phone's operating system stops working sometimes and I have to restart it.\nI think it's a very expensive phone for its function.",
            "rating": 2.0
        },
        {
            "name": "Amazon Customer",
            "location": "United States",
            "date": "September 19, 2024",
            "verified-purchase": true,
            "review-body": "I gave it 5 stars for the simple fact that it’s bright graphic images, different looking. Also because is low maintenance, and can’t beat 8 Ram and 256 memory for the price. I went to metro phones with same ram and memory are over $800 that’s insane.",
            "rating": 5.0
        },
        {
            "name": "JS",
            "location": "United States",
            "date": "October 25, 2024",
            "verified-purchase": true,
            "review-body": "Bought this as a gift for my wife - she loves if. I like it so much that I will probably order another for me.\nLight weight and just feels right in your hand.",
            "rating": 5.0
        },
        {
            "name": "Earl J Drew",
            "location": "United States",
            "date": "December 14, 2024",
            "verified-purchase": true,
            "review-body": "Nice product",
            "rating": 5.0
        },
        {
            "name": "keith hinegardner",
            "location": "United States",
            "date": "November 21, 2024",
            "verified-purchase": true,
            "review-body": "Long battery life , snappy phone quick in apps.upgraded from Samsung 10.",
            "rating": 5.0
        },
        {
            "name": "Trevor S.",
            "location": "United States",
            "date": "September 11, 2024",
            "verified-purchase": true,
            "review-body": "The phone is beautiful! It doesn't get hot at all and the fast charging is great! I would recommend to anyone who wants all the trimmings at a budget price. Thank you Blu!!! Great buy!!!",
            "rating": 5.0
        },
        {
            "name": "David",
            "location": "United States",
            "date": "November 5, 2024",
            "verified-purchase": true,
            "review-body": "Amazing cellphone outperforms my family members overpriced devices at a fraction of the cost great picture incredibly smooth and responsive",
            "rating": 5.0
        },
        {
            "name": "Sarcastic1978",
            "location": "United States",
            "date": "April 15, 2025",
            "verified-purchase": true,
            "review-body": "The Only Reason Why I Give This Phone 1 Star Is Because : The Little App Icons From The Apps That I Use, Keep Popping Up Way To Frequently. I Called The Blu Customer Service & They Said The Reason Is Because Those Are The Apps That I Frequently Use. Even Though I Press & Hold To Get Rid Of This, They Still Keep Popping Up. I Have No Use For This Feature & It's Annoying !!!!",
            "rating": 1.0
        },
        {
            "name": "Shannon Thompson",
            "location": "United States",
            "date": "September 14, 2024",
            "verified-purchase": true,
            "review-body": "Great phone...image is awesome battery seems to last but idk about the reviews that say this gets hot because mine doesn't...you won't find a better phone for under $200",
            "rating": 5.0
        },
        {
            "name": "Tenisha",
            "location": "United States",
            "date": "September 27, 2024",
            "verified-purchase": true,
            "review-body": "I love this phones works perfectly.. I however wished it had a SD slot",
            "rating": 5.0
        },
        {
            "name": "Alex",
            "location": "United States",
            "date": "November 20, 2024",
            "verified-purchase": true,
            "review-body": "Was very excited to get the phone but when I checked with Cricket wireless, they said the phone is not compatible with their network. Nothing against the phone at all, I'm sure it's great.",
            "rating": 2.0
        },
        {
            "name": "Rafael E Batista",
            "location": "United States",
            "date": "October 13, 2024",
            "verified-purchase": true,
            "review-body": "This cellphone is amazing 💪🏻",
            "rating": 5.0
        },
        {
            "name": "Melinda Nagy",
            "location": "United States",
            "date": "August 8, 2024",
            "verified-purchase": true,
            "review-body": "Good quality camera, slim design, Android 14, affordable, quality audio",
            "rating": 5.0
        },
        {
            "name": "hdemo23",
            "location": "United States",
            "date": "October 3, 2024",
            "verified-purchase": true,
            "review-body": "Great buy!!!",
            "rating": 5.0
        },
        {
            "name": "glen taylor",
            "location": "United States",
            "date": "January 6, 2025",
            "verified-purchase": true,
            "review-body": "Worked fine no issues until I lightly leaned on it almost no weight (if you are the type to put it in your back pocket your screwed with this phone) and the screen stopped working that's ridiculous for how much you pay for this phone will not buy again",
            "rating": 1.0
        },
        {
            "name": "Steven J.",
            "location": "United States",
            "date": "February 21, 2025",
            "verified-purchase": true,
            "review-body": "After charging for approximately 1 hour phone wont turn on\nBoth Amazon and blu claiming it's not there problem",
            "rating": 1.0
        },
        {
            "name": "NormalEveryDayOrdinaryPerson",
            "location": "United States",
            "date": "December 18, 2024",
            "verified-purchase": true,
            "review-body": "Bought for my wife. Within minutes of powering up, the screen froze and then blacked out. Phone will not charge or power up. Never had issues like this with a Blu phone. Will try to get in touch with Amazon customer service soon.",
            "rating": 1.0
        },
        {
            "name": "John",
            "location": "United States",
            "date": "March 1, 2025",
            "verified-purchase": true,
            "review-body": "This phone is junk... you will regret buying it",
            "rating": 1.0
        },
        {
            "name": "DG",
            "location": "United States",
            "date": "November 5, 2024",
            "verified-purchase": true,
            "review-body": "NO SD CARD slot no expandable memory. that is the reason i like Android. This is going back.\n\nThe clear phone case is cheap cheap cheap. I am totally disapointed with this. I am going to have to return the other case that I ordered also. Neither were good.",
            "rating": 1.0
        },
        {
            "name": "Thomas J. Morrison II",
            "location": "United States",
            "date": "October 11, 2024",
            "verified-purchase": true,
            "review-body": "Had to send phone back. PROS- It is a fast phone and sounds and calls come in crystal clear. CONS- It downloads too many games and Android Auto would not work in my car. No dice! I'll stick with the 4G brands from here on out!",
            "rating": 1.0
        },
        {
            "name": "Robert C Watson",
            "location": "United States",
            "date": "December 18, 2024",
            "verified-purchase": false,
            "review-body": "I have a Blu G93 and I love it. But I want my next phone to have an eSim for easier international travel. This new phone apparently has no eSim capability. In reading the reviews I was disappointed to read there is no headphone jack and that the sim tray use was difficult to use.",
            "rating": 3.0
        },
        {
            "name": "Marialcira Rincon S",
            "location": "United States",
            "date": "November 8, 2024",
            "verified-purchase": false,
            "review-body": "I love BLU brand. But being the K50 the last phones I disappointed with:\n1. It's false that the battery last 3 days\n2. The camera has poor zoom.\n3. The protector's, case and screen, are very poor. In fact the screen protector is smaller than the screen. And the case very slippery.\n4. Blu took out the touching wake screen.\n5. The predictive function for apps is just CRAZY.\nWell, I will be using it, and check what happen.",
            "rating": 3.0
        },
        {
            "name": "Lam",
            "location": "United States",
            "date": "August 30, 2024",
            "verified-purchase": false,
            "review-body": "Phones are becoming more impressive by the day. The design is better than most phones you can get for an equal price at your local shop. For the price, this phone is definitely 5 stars despite a couple of setbacks.\nThe pros of this phone:\nBattery life. I found the battery life to be as advertised. The out of box life is close to 3 days on idle, and you get a solid 24 hours of use out of it otherwise, which I find very acceptable.\nStorage: 256gb out of the box is very good. The amount of space is plenty of room to download practically everything I would use on my phone without having to worry about storage space.\nRAM: 8GB of standard ram plus 16GB of Xram. As far as I understand operates as RAM more or less.\nCpu power. As far as the power of the processor goes, this is a great value for the price range. I tried playing a few games and none had any lag which is a big positive.\nPicture quality: Excellent. Even budget phones now have an excellent DPI and the colors come out bright and vibrant.\nCamera quality: Very high. I'm very happy with the picture quality. It lacks some of the zoom capabilities of higher end phones, but I can't find a phone with picture quality that matches this for the price.\n\nA couple of cons I've noticed:\nCharges slowly. Unfortunately you won't get the fast charging speed of high end phones.\nDoes not work with every carrier. Some carriers are not compatible with this phone which is a negative.\nTries to install some bloat at startup. Attempts to install games and apps you don't want and didn't ask for, this is never a welcome feature for me.\n\nThat said, I find it hard to find a better deal than the Bold K50 for the price. I'm currently using it as my backup phone and to play a lot of games that would kill the battery of my main phone.",
            "rating": 5.0
        },
        {
            "name": "Johnny_Amazon®",
            "location": "United States",
            "date": "September 3, 2024",
            "verified-purchase": false,
            "review-body": "I mean, even if the rest of the phone was subpar, $200 for an AMOLED phone is a steal IMO. Even at $300 for an AMOLED phone was almost unheard of just a few years ago, but here we are, and even from a reputable brand at that. When Blu first started making phones like 6-7 years ago (or at least that's when I found out about them), they already stood out being known as a budget phone company that made phones with good specs and reliability. I think I tried two phones from Blu back in the day, and even though they were not memorable experiences (at that time I was more interested in phones from LG, HTC, Sony, etc.), they did leave an impression how inexpensive their phones were. This trend continues until today, and this phone shows that $200 has come a long way, cuz their phones back then were in the $100-$200 range, but didn't have anything in the premium realm such as an AMOLED screen. The only that comes close is the A series from Samsung, but usually those are around $300.\n\nThis particular phone has a similar design language as the old S9/S10/S11 Samsung Galaxy phones, with the very slim bezels, curved sides, and pinhole camera front screen. The processor is not great, but does just enough to run most apps from the Google Play Store, and play a few games. The RAM and memory is generous though, at 8Gb and 256GB, respectively. The cameras are overall decent - pretty good during the day or in bright lighting, and a bit fuzzy in low-light. The best part is always going to be the AMOLED screen, so definitely get this if your main apps would be YouTube, Netflix, and the other various media streaming apps. For $200, and with the Blu reputation, you can't go wrong at this price range.",
            "rating": 5.0
        },
        {
            "name": "Chris Brown",
            "location": "United States",
            "date": "April 17, 2025",
            "verified-purchase": true,
            "review-body": "Amazing phone for the value. If your on a budget you will not be disappointed in the quality of this phone. Flagship phone features without breaking the bank!",
            "rating": 5.0
        },
        {
            "name": "JP",
            "location": "United States",
            "date": "January 23, 2025",
            "verified-purchase": true,
            "review-body": "My phone stop sending or receiving calls, texts or emails. After multiple reboots, the phone worked for a few days. Then went back to not receiving or sending calls, text or emails.. I've own multiple Blu cell phones, this one was the worst.",
            "rating": 1.0
        },
        {
            "name": "Will Brugge",
            "location": "United States",
            "date": "November 11, 2024",
            "verified-purchase": true,
            "review-body": "While I've only been using the Blu Bold K50 for a day, I'm extremely impressed! I'm switching over from a Google pixel 6, which I've used for nearly 3 years. The screen is SUPER impressive. Very bright and vivid colors. It's snappy and hasn't had any software issues yet. The charging was fast and the cameras all exceed expectations in a phone under $300, let alone $200. I'm not a fan of the curves screen design, but I had a galaxy s9, so I'm not unfamiliar.\n\nAll in all, I highly recommend this phone. It's an absolute steal at the $200 price point. I'll update this review if anything changes.\n\nI'm using this device on T-Mobile and I've had no issues with connectivity.\n\n***Two week update: Super impressed overall. I don't like the curved screen, but the battery life is amazing. The screen is amazing. The cameras are solid. I've had zero connectivity issues. The phone is fast enough for what i need it for. This phone at $199 is an absolute no brainer.",
            "rating": 5.0
        },
        {
            "name": "Deshawn Williams",
            "location": "United States",
            "date": "October 7, 2024",
            "verified-purchase": true,
            "review-body": "This is my first blu phone and I'm very impressed to say the least. The screen is very good it's get plenty bright it's a curved display with 120hrz. Running day to day apps like Facebook, Instagram and tiktok runs with no problem. Text messaging, switching back and forth between apps is really smooth with the 120hrz display. It's running a near stock version of android 14. There's no skin like some Redmi phones. You might experience a hiccup or two here and there but that's not a deal breaker at all. Very slim, lightweight phone that fits perfectly in my pocket with my other phone. The camera and speaker are probably the only downfall to this phone. The speaker isn't that loud and lacks base. The camera isn't to bad if you're in decent lighting and using the main 64 megapixel camera. not bad but I've definitely seen better. I'm using this phone on mint mobile. I have no problems with getting notifications text messages and RCS chats work I get 5G connectivity with speeds over 50mb per second. Overall I really like the design of this phone the software. haptic feedback is very good when typing. The screen is probably the best that you can get in this price point. I would recommend if your looking for cheep android phone that can do it all",
            "rating": 5.0
        },
        {
            "name": "K50 case",
            "location": "United States",
            "date": "October 7, 2024",
            "verified-purchase": true,
            "review-body": "Love this phone.. work great. fast louding apps . great connectivity.sound is good, touch screen respond fast. And super clear.. Battery lasts for long periods. Loved ..for the price is good..",
            "rating": 5.0
        },
        {
            "name": "Sylvio",
            "location": "United States",
            "date": "January 14, 2025",
            "verified-purchase": true,
            "review-body": "I literally got it this morning, logged in to my Google account to complete the setup, and the phone froze, shutdown, and would not turn back on no matter what. The unit completely died within 10 minutes of unboxing. Horrible. Their BOLD devices were not previously this bad. I would not recommend.",
            "rating": 1.0
        },
        {
            "name": "Walter Aguero",
            "location": "United States",
            "date": "February 11, 2025",
            "verified-purchase": true,
            "review-body": "The device does not turn on.\nIt arrived yesterday, I need to be advised to change the device or get my money back. I am not satisfied and I would like a quick solution.",
            "rating": 1.0
        },
        {
            "name": "MARTY",
            "location": "United States",
            "date": "November 17, 2024",
            "verified-purchase": true,
            "review-body": "IT WAS TOTALLY DEFECTIVE!",
            "rating": 1.0
        },
        {
            "name": "Vie DeVito",
            "location": "United States",
            "date": "April 8, 2025",
            "verified-purchase": true,
            "review-body": "Respectfully humbly lovingly kindly peaceLoVe\n\n12 star integrity very impressive BLU K5O handy phone, I would highly recommend this one doesn't disappoint I was absolutely impressed, blown away!\nFor the very affordable price it satisfies flawlessly yes!.\nNo disrespect to Motorola but this one if only Motorola could make a phone as good as this would be good yes.\n\nNote: if there was awards for the best affordably priced handy phone just my opinion, I think this BLU K-50 truly deserves an award for outstanding lightning fast speed design bells and whistles, absolutely outstanding.\n\nKindest most humble loving regards,",
            "rating": 5.0
        }
    ]
}