{
    "asin": "B0DSSBWLYM",
    "productName": "JJGJ 10 Inch Android Tablet, 12GB RAM 128GB Storage (Expandable to 1TB), 5G WiFi, 8000mAh Long Battery Life, Octa-Core Processor, Dual Camera (5MP+8MP), Face Unlock, Black",
    "reviews": [
        {
            "name": "Amazon Customer",
            "location": "United States",
            "date": "March 27, 2025",
            "verified-purchase": true,
            "review-body": "I am utterly delighted with the JJGJ 10 Inch Android Tablet! This phenomenal device has surpassed my expectations with its exceptional capabilities, dazzling display, and impressive array of features.\n\nSuperb Processing Power\n\nThe tablet's 12GB of RAM and octa-core processor deliver blistering performance, enabling me to effortlessly juggle multiple tasks, enjoy seamless gaming, and stream content without any hiccups.\n\nBreathtaking Visuals\n\nThe 10-inch IPS display is a true showstopper, boasting vivid colors, razor-sharp text, and an expansive viewing angle. Whether I'm immersed in videos, browsing the web, or devouring e-books, the display is consistently brilliant.\n\nAndroid 12 Operating System\n\nThe tablet comes equipped with the latest Android 12 operating system, providing a silky-smooth and intuitive user experience. I'm particularly fond of the enhanced security and privacy features.\n\nAll-Day Battery Life\n\nThe tablet's battery life is remarkably impressive, with up to 10 hours of uninterrupted video playback and internet browsing on a single charge. This means I can use the tablet throughout the day without needing to recharge.\n\nAdditional Perks\n\nThe tablet also boasts an impressive 13MP rear camera, 5MP front camera, dual SIM card slots, and a microSD card slot. These features make the tablet perfect for capturing life's moments, making video calls, and expanding my storage capacity.\n\nRating Breakdown\n\n路 Processing Power: 5/5\n路 Display: 5/5\n路 Operating System: 5/5\n路 Battery Life: 5/5\n路 Additional Perks: 5/5\n路 Overall: 5/5\n\nRecommendation\n\nI wholeheartedly recommend the JJGJ 10 Inch Android Tablet to anyone seeking a powerhouse device that combines impressive performance, stunning visuals, and a wealth of features at an affordable price.",
            "rating": 5.0
        },
        {
            "name": "Shan shan",
            "location": "United States",
            "date": "April 10, 2025",
            "verified-purchase": true,
            "review-body": "I have surprise my daughter with this tablet for doing good in school and this tablet is her new best friend the battery life is good the screen work perfectly the camera quality would be more ,it was easy to set up and the screen quality is great also love the keyboard and other stuff that came with it the speed is fine",
            "rating": 5.0
        },
        {
            "name": "Kirsten Brand",
            "location": "United States",
            "date": "March 11, 2025",
            "verified-purchase": true,
            "review-body": "Really good tablet. Operates as a laptop and works very well. Camera is good. Battery last day. My kids use it for school and the speed is quick. Plenty of options for storage and way to set up. The picture quality is vivid and for the price its a great choice. Comes within a bunch of accessories.",
            "rating": 5.0
        },
        {
            "name": "ahorn",
            "location": "United States",
            "date": "December 6, 2024",
            "verified-purchase": true,
            "review-body": "Good size. Came with some awesome accessories. Speakers kind of suck for streaming shows and movies compared to the name brand fruit tablet.",
            "rating": 4.0
        },
        {
            "name": "CC",
            "location": "United States",
            "date": "April 6, 2025",
            "verified-purchase": true,
            "review-body": "RUNS GOOD. REASONABLE PURCHASE.",
            "rating": 5.0
        },
        {
            "name": "CharlieVIE",
            "location": "United States",
            "date": "March 28, 2025",
            "verified-purchase": true,
            "review-body": "The media could not be loaded.\nOh boy, this tablet is garbage. Believe the reviews when the say it is slow. The Bluetooth keyboard it came with does not connect. I don't even know if the keyboard is on. The power button comes on for a second when you turn it on, then goes dark. And I charged it for 6 hours as per instructions.\n\nThis is definitely a case of \"you get what you pay for.\"\n\nThere is an LED for the caps lock key and one would think that it would turn on if you press the key. Not on this key board.\n\nTo make it short. DO NOT BUY THIS PIECE OF _______.",
            "rating": 1.0
        },
        {
            "name": "the electrician",
            "location": "United States",
            "date": "January 25, 2025",
            "verified-purchase": true,
            "review-body": "Tablet doesnt lag, battery is great, speakers are quiet so pair it with Bluetooth. The little keyboard worked perfectly. Unbelievably good value",
            "rating": 5.0
        },
        {
            "name": "Kindle Customer",
            "location": "United States",
            "date": "March 23, 2025",
            "verified-purchase": true,
            "review-body": "Easy to set up",
            "rating": 5.0
        },
        {
            "name": "Riley",
            "location": "United States",
            "date": "April 13, 2025",
            "verified-purchase": true,
            "review-body": "This tablet is a good value for money. The storage is good enough to read, draw, watch videos. The battery can last long enough. It will be perfect if it has more wallpaper options",
            "rating": 5.0
        },
        {
            "name": "Liz",
            "location": "United States",
            "date": "April 13, 2025",
            "verified-purchase": true,
            "review-body": "Tablet works great. Easy set up. Love it",
            "rating": 5.0
        },
        {
            "name": "About The Details",
            "location": "United States",
            "date": "December 20, 2024",
            "verified-purchase": true,
            "review-body": "The display is bright (on 100%). Colors on YouTube videos are good. The sound is thin and sounds like it is in a tin can! The default media volume was max and turning it down helped the harshness. Still thin sounding. Android doesn't seem to have an EQ yet and the few I downloaded didn't do much and had annoying ads.\n\nI cannot address the CPU speed. I added a microSD card to move data. The case is a thick, hard-to-cut plastic. I cut some out for the microSD card so it can be removed. A USB-C thumb drive can be used as well.\n\nKeyboard is thin and rechargeable. The mouse is also squat and uses two AAA batteries. Both may be difficult to use for an extended period.",
            "rating": 4.0
        },
        {
            "name": "Prince Timmy",
            "location": "United States",
            "date": "February 16, 2025",
            "verified-purchase": true,
            "review-body": "This product is great and I recommend it to anyone.",
            "rating": 4.0
        },
        {
            "name": "R2",
            "location": "United States",
            "date": "February 18, 2025",
            "verified-purchase": true,
            "review-body": "This tablet has been great so far. The case, keyboard and mouse makes it even better. I plan to get a data plan for it when I start at a new job and will report back on how it works out of the house. I would highly recommend it!",
            "rating": 5.0
        },
        {
            "name": "DJ stereo",
            "location": "United States",
            "date": "March 19, 2025",
            "verified-purchase": true,
            "review-body": "This is nice",
            "rating": 5.0
        },
        {
            "name": "Why with the auto rotate off why does the screen still rotate?",
            "location": "United States",
            "date": "March 7, 2025",
            "verified-purchase": true,
            "review-body": "Like it very much what kind of screen protector should I get for it?",
            "rating": 5.0
        },
        {
            "name": "El producto a煤n no lo he recibido",
            "location": "United States",
            "date": "March 13, 2025",
            "verified-purchase": true,
            "review-body": "Excelente",
            "rating": 5.0
        },
        {
            "name": "Chief Brody",
            "location": "United States",
            "date": "November 7, 2024",
            "verified-purchase": true,
            "review-body": "Let me get the only issue we had here out of the bag right upfront: the first tablet of these we bought had a uniformity issue where the LEDs were visible at the bottom of the screen -- we returned it for another one which had no such issues. That being said, this is a dynamic little generic Android tablet for the money. I was bored with my Fire HD from 2021 which was slow to open up pretty much any app, and this Android 14 tablet was so much faster. Youtube TV, Chrome, etc. all booted up quick and was plenty responsive. The brightness is also fantastic, I had to turn it way down for most uses so that's not an issue. The screen isn't the highest resolution but it's \"serviceable\" but you get what you pay for, and then some, with the price point of this. The company even packed in a mouse and keyboard -- what's not to love? I can see this being a real overperformer on Black Friday or similar holidays if it goes on sale. For the money it's a great option.",
            "rating": 5.0
        },
        {
            "name": "J",
            "location": "United States",
            "date": "February 2, 2025",
            "verified-purchase": true,
            "review-body": "Needed a larger screen for a piano learning app. Nothing wrong with this tablet. Other reviewers praised the battery life, but I don't agree. I would say battery life is average but not excellent. Also it comes with a case, keyboard and mouse.",
            "rating": 5.0
        },
        {
            "name": "Mauricio",
            "location": "United States",
            "date": "March 22, 2025",
            "verified-purchase": true,
            "review-body": "Bastante lenta, la ram es virtual. Es gama baja. Funciona bien para su precio.",
            "rating": 3.0
        },
        {
            "name": "jcinohio",
            "location": "United States",
            "date": "January 25, 2025",
            "verified-purchase": true,
            "review-body": "I got this tablet as a backup , but it became my favorite. I use it to play games like Farmville and the colors are vibrant. The protective cover is a nice benefit that I hadn't thought much about. Overall very pleased with this purchase.",
            "rating": 5.0
        },
        {
            "name": "Michael",
            "location": "United States",
            "date": "November 19, 2024",
            "verified-purchase": true,
            "review-body": "Very good nice tablet for the money",
            "rating": 4.0
        },
        {
            "name": "Elishia Harrell",
            "location": "United States",
            "date": "November 18, 2024",
            "verified-purchase": true,
            "review-body": "I originally picked the tablet because it said that it offered a lot of storage and was supposed to be fast. Plus, I wanted the keyboard and everything else that came with it. I like the size and all the accessories, except I had to throw away the screen protector. It said it had 7000 or 8000 mah battery. When I got it I didn't turn it on I fully charged it and then I turned it on afterwards. I updated it and downloaded everything I needed to on it and used it for about 5 hours and then it needed to be charged again. I like it besides feeling like I got lied to.",
            "rating": 3.0
        },
        {
            "name": "semra",
            "location": "United States",
            "date": "February 10, 2025",
            "verified-purchase": true,
            "review-body": "This is an awesome deal , great package..",
            "rating": 5.0
        },
        {
            "name": "shannon owens",
            "location": "United States",
            "date": "January 28, 2025",
            "verified-purchase": true,
            "review-body": "It is a good tablet",
            "rating": 5.0
        },
        {
            "name": "Mj",
            "location": "United States",
            "date": "December 20, 2024",
            "verified-purchase": true,
            "review-body": "The media could not be loaded.\nGreat purchase! Functional just like a computer, nice size , and storage space. AND ALL THE ACCESSORIES THAT WAS ATTACHED LOVE IT !!!",
            "rating": 5.0
        },
        {
            "name": "ronhawk62",
            "location": "United States",
            "date": "December 17, 2024",
            "verified-purchase": true,
            "review-body": "The battery lasts a long time, and it is easy to use",
            "rating": 5.0
        },
        {
            "name": "DAMITDD",
            "location": "United States",
            "date": "March 28, 2025",
            "verified-purchase": true,
            "review-body": "This tablet gets a two because it keeps crashing. Can not open one app without it crashing unfortunately. I purchased for the processor and memory. But it won't even boot up without crashing.",
            "rating": 2.0
        },
        {
            "name": "StupidArien2",
            "location": "United States",
            "date": "November 25, 2024",
            "verified-purchase": true,
            "review-body": "Got this for my side bussiness, and I am pleased with the products.",
            "rating": 5.0
        },
        {
            "name": "Judeee",
            "location": "United States",
            "date": "March 20, 2025",
            "verified-purchase": true,
            "review-body": "I've tried everything possible and it won't accept my Wi-Fi password. The last resort I have is to move it closer to the router. If that doesn't help I have to return it I don't want to deal with this problem and I'm scared to death to reset any of this TV equipment.",
            "rating": 1.0
        },
        {
            "name": "Leah",
            "location": "United States",
            "date": "February 26, 2025",
            "verified-purchase": true,
            "review-body": "Just 2 months since I bought this an it has not been used much and now temp warning keeps popping up then it automatically shuts down and it doesn't matter how many days you left it off",
            "rating": 1.0
        },
        {
            "name": "Kevin Hall",
            "location": "United States",
            "date": "February 24, 2025",
            "verified-purchase": true,
            "review-body": "Liked the product ran fast smooth & great for the 1st 2 months then battery overheating messages consistently kept popping up so we stop using it for safety issues..",
            "rating": 1.0
        },
        {
            "name": "Jessie Matavao",
            "location": "United States",
            "date": "February 9, 2025",
            "verified-purchase": true,
            "review-body": "Doesnt work. \n\nStill havent use it - touch screen not working",
            "rating": 1.0
        },
        {
            "name": "Fiksd IT",
            "location": "United States",
            "date": "April 1, 2025",
            "verified-purchase": false,
            "review-body": "Works well. The device doesn't \"lag\" like others I have had. The battery life on this is decent, but I would keep an eye on it, as it seemed like it drained when it got low. The screen is great, didn't seem to have any issues... resolution looks good, so websites and such are vibrant like they should be.",
            "rating": 4.0
        },
        {
            "name": "Nicole T.",
            "location": "United States",
            "date": "January 19, 2025",
            "verified-purchase": false,
            "review-body": "This 10-Inch Android Tablet is designed for productivity and entertainment, packed with features to keep up with your busy life. Heres why it stands out:\n\nImpressive Performance: Equipped with 12GB RAM and an Octa-Core processor, this tablet delivers smooth multitasking and speedy app performance, perfect for work or play.\n\nAmple Storage: With 128GB built-in storage expandable up to 1TB, youll never have to worry about running out of space for your apps, photos, videos, and documents.\n\nAndroid 14 Advantage: Running the latest Android 14, this tablet offers enhanced security, seamless updates, and access to the newest features and apps.\n\nConvenient Keyboard: The included keyboard transforms this tablet into a mini laptop, making it ideal for typing-intensive tasks, whether at the office or on the go.\n\nVivid 10-Inch Display: Enjoy a clear and vibrant viewing experience on the 10-inch screen, perfect for streaming videos, gaming, or browsing the web.\n\nSleek and Portable: The compact design and lightweight build make it easy to carry, while the black finish adds a sleek, modern touch.\n\nConnectivity and Expandability: With multiple connectivity options and expandable storage, this tablet adapts to your needs, making it a versatile companion.\n\nThe 10-Inch Android Tablet with Keyboard is a powerhouse of productivity and entertainment. Its combination of robust performance, ample storage, and flexibility makes it the perfect device for anyone looking to stay connected and efficient.",
            "rating": 5.0
        },
        {
            "name": "Customer Review",
            "location": "United States",
            "date": "October 31, 2024",
            "verified-purchase": false,
            "review-body": "I give this Android tablet 4 stars. It has plenty of storage, which is great for keeping photos and apps. The 10-inch screen is decent, but honestly, I wish the resolution was better. With all the tech advancements lately, I expected a clearer resolution. The battery life is solid, lasting through movies and music without completely draining.\n\nThe case feels sturdy and provides good protection, which is a plus. I also appreciate the included keyboard; it adds a nice bit of value and makes it easier to type out emails or documents. It connects easily to Wi-Fi and Bluetooth, which is nice for streaming or using it with other devices. The cameras are okay too; they do the job for video calls or quick snaps. They suffice for being from a tablet camera, but even my phone takes a better picture. Overall, this is a good tablet for everyday use, but it could definitely use a better display. At its current price point, this is a fair bargain that could be gifted this upcoming holiday season!",
            "rating": 4.0
        },
        {
            "name": "mary j",
            "location": "United States",
            "date": "November 5, 2024",
            "verified-purchase": false,
            "review-body": "I ordered this Android tablet for everyday home use because it was offered at a price I could not pass up. It will supplement my other Android tablet and PC.\nIt is my first tablet that comes with a mouse and keyboard, and I enjoy the added capabilities of those devices, which easily paired with Bluetooth. It also includes a nice case that is also used as a stand, which is very convenient.\nThe tablet has everything that I would expect from one at this price point.\nIt powers up quickly, and I am satisfied with the display.\nThe 13MP camera takes decent photos and the sound quality is food , though not great.\nThe battery seems to run down faster than my other Android tablet, but I have not yet had the opportunity to optimize all the apps and their settings.\nI'm aware that I can increase storage size by an additional 128GB with a micro-SD card, but so far I've been unable to determine for sure where to insert the card.\nI'm very impressed with this 10 inch tablet and will highly recommend it.",
            "rating": 5.0
        },
        {
            "name": "The Clarks",
            "location": "United States",
            "date": "December 9, 2024",
            "verified-purchase": false,
            "review-body": "With its wireless keyboard and case it literally feels like a laptop. Works well with a mouse keyboard. Is the version of a laptop. Easy set up and high quality screen. Comes with everything so it's a great value for the money.",
            "rating": 5.0
        },
        {
            "name": "Edward Martin III",
            "location": "United States",
            "date": "November 27, 2024",
            "verified-purchase": false,
            "review-body": "Nice tablet, especially for travel. Added keyboard is great if (like me) you travel and you also want to write while you're out and about.",
            "rating": 5.0
        },
        {
            "name": "Mike",
            "location": "United States",
            "date": "November 10, 2024",
            "verified-purchase": false,
            "review-body": "Snappy, responsive, looks nice. Comes with custom case, mouse, and keyboard. Would have liked it if the case had a way to stay closed, it just kind of flaps open. I like that it is Android OS 14, I hope that it will continue to receive updates for a long time. Battery life is decent, I have another one with a 10,000 mAh battery with the same specs that does last longer. This is good for about an 8 hour binge session of watching videos.",
            "rating": 5.0
        },
        {
            "name": "Joff",
            "location": "United States",
            "date": "November 2, 2024",
            "verified-purchase": false,
            "review-body": "I got this tablet to use as a side media device whenever I'm on the go. I never want to carry around expensive electronics and this tablet is in a good enough price range that I wouldn't be completely torn if if I lost it or if it broke. The overall performance of this for an Android tablet is great, especially when you think of where it's priced at.\n\nHaving the keyboard and mouse come with it is a great addition so you can have it act as a laptop for writing documents or doing some lightweight work on it when you're on the go.",
            "rating": 5.0
        },
        {
            "name": "TwiggLe",
            "location": "United States",
            "date": "November 1, 2024",
            "verified-purchase": false,
            "review-body": "Comes with case, keyboard, mouse, screen protector. This is a quick tablet for all your needs. Runs all the games my kids play without issue. Feels pretty solid in build quality. Like that it came with Android 14. Hopefully it still gets Android 15 at some point or atleast future security updates.",
            "rating": 5.0
        },
        {
            "name": "clint",
            "location": "United States",
            "date": "February 27, 2025",
            "verified-purchase": false,
            "review-body": "This tablet has performed very well so far. It's great value for the price. I highly recommend it!",
            "rating": 5.0
        },
        {
            "name": "Caleb Rountree",
            "location": "United States",
            "date": "October 22, 2024",
            "verified-purchase": false,
            "review-body": "I love this tablet 1920x 1200 Display, it's fast, doesn't take forever to start up, easy to use. The display is clear and crisp. when I download a project I want to build I trace the dimensions they show so I don't waste paper printing it. I an very happy with this tablet.",
            "rating": 5.0
        }
    ]
}